# Relational Databases and SQL
- *By Attius!*
- *Last updated February 2022*

---

This Jupyter notebook is divided into handful of sections:

1. **Learning Resources**--provides links to the learning resources used to create this document
1. **Relational & NoSQL Databases**--quickly describes the differences between relational and non-relational data storage models
1. **DBMS**--quickly compares the most popular database management systems (DBMS) and client integrated development environments (IDEs) in use today
1. **Relational Databases**--explores the concepts of tables, keys, normalization, relationships, and joins
1. **SQL**--covers structured query language (SQL) terminology and syntax.  It then provides examples of the most common SQL statements by using the SQLite RDBMS.
1. **PostgreSQL**--covers RDBMS topics and SQL syntax specific to the PostgreSQL RDBMS

---

# Learning Resources

SQL resources.  I would recommend viewing the SQL resources in the the order listed.

1. **[Select Star](https://selectstarsql.com/)**--describes SQL statements.  Allows users to run statements on an example database.   Integrates the real-life story of a death row inmate into examples.
1. **[SQL Murder Mystery](https://mystery.knightlab.com/)**--practice problems for intermediate SQL users.  Integrates fictional mystery story-line into practice problems.
1. **[W3 Schools SQL](https://www.w3schools.com/sql/)**--describes SQL statements.  Allows users to run statements on an example database.  Well organized and easy to follow website that covers a greater breadth of SQL statements than Select Star or SQL Murder Mystery.
1. **[SQL Fiddle](http://sqlfiddle.com/)**--build a cloud-hosted test database and test SQL statements.  Run  statements for MySQL, PostgreSQL, MS SQLServer, Oracle, or SQLite.


Relational database and RDBMS resources:

1. **[Everything you need to know about (Relational) Databases](https://dev.to/lmolivera/everything-you-need-to-know-about-relational-databases-3ejl)**--blog post by Lucas Olivera covering relational databases
1. **[ERD](https://www.youtube.com/watch?v=QpdhBUYk7Kk)**--video by LucidCharts explaining ERDs
1. **[ipython-sql GitHub](https://github.com/catherinedevlin/ipython-sql)**--documentation for `ipython-sql`.  `ipython-sql` is a Jupyter Lab extension that allows us to run SQL commands from within Jupyter notebooks.
1. **[SQLite Documentation](https://www.sqlite.org/docs.html)**--SQLite documentation.  Helpful documents for beginners include some documents found in the *Overview Documents* section.  The documents *SQLite in 5 Minutes or Less*, *Data Types*, *SQL Syntax*, and *Aggregate SQL Functions*, found in the *Programming Interfaces* section are also very helpful.  SQLite documentation often explain commands with "syntax diagrams".


PostgreSQL specific learning resources:

1. **[PostgreSQL Documentation](https://www.postgresql.org/docs/current/index.html)**--PostgreSQL documentation.  When viewed as PDF it is ~3,000 pages long.  The entirety of the *Preface*, *I. Tutorial*, and *II. The SQL Language* sections contain helpful documentation for beginners.  Other helpful documentation include *I. SQL Commands* within the *VI. References* section Note that SQL command overviews use square brackets to indicate optional  parts.  Curly braces and vertical lines indicate that we must choose one of the parts enclosed in the braces.  Three periods indicate that preceding elements can be repeated.
1. **[psql Documentation](https://www.postgresql.org/docs/14/app-psql.html)**-- psql documentation
1. **PostgreSQL for Everyone Specialization**-- Coursera specialization on PostgreSQL from Dr. Chuck at the University of Michigan.  It is a strictly average course and requires a bit of Python.  Does provide good information on indexes, JSON, ACID, and BASE.  Course content also found at [PostgreSQL for Everyone](https://www.pg4e.com).

PostgresSQL + Python specific learning resources:

1. **[Psycopg Documentation](https://www.psycopg.org/psycopg3/docs/basic/index.html)**--Psycopg documentation
1. **[Python Database API Specification 2.0](https://www.python.org/dev/peps/pep-0249/)**--Python database library standards documentation

---

# Relational & NoSQL Databases

- All databases are **CRUD**:
    1. Create data
    2. Read (query) data
    3. Update data
    4. Delete data
- There are many ways that we can store data within a computer and CRUD.  The broad categories are:
    1. **Relational Database**--collection of tables that are *related* to each other by data common to each.  It involves tables, primary and foreign keys, and **Structured Query Language (SQL)**.  This is the most common model used to store data (don't worry about the OLAP cube).
    1. **NoSQL Database**--any database that is not relational.  NoSQL databases store and retrieve data using various organizational models.
        1. **Key-value**--value is the data of interest.  Unique keys are used to retrieve the value.
        1. **Document**--similar to key-value.  Value is itself a "document".  The document is a file of data encoded with JSON, XML, YML, BSON, etc..
        1. **Wide-column/column-family**--tables where individual columns can vary in data type from row to row
        1. **Graph**--store data as nodes in network graphs

![](images/no_sql.png)

- The table below provides a high level overview of the differences between relational and NoSQL databases:

Feature | Relational Database | NoSQL Database
--- | --- | ---
Data model | Related tables | Key-value, document, wide-column, or graph
Data organization | Structured data | Unstructured data
Flexibility | Fixed database schema  | Flexible schema
Language | SQL | No standardized query language
Consistency | ACID compliant  | BASE compliant
Scalability | Easily scales vertically, but not horizontally | Easily scales vertically and horizontally
Speed | Fast | Fast

- **Structured Data**--vague term that refers to data that fits well in related tables
    - E.g. financial, health care, and user account data
- **Unstructured Data**--vague term that refers to data that is hard to fit in a table.  If records have tons of optional columns then data may be more "unstructured".
    - E.g. text documents, web pages, audio, images, and video. Lots of social media data.
- **Semi-structured Data**--a blend
    - E.g. email, text, and chat messages.  Product catalog  data.
- **Scale**--increase database size (storage amount, in bytes, of non-volatile computer memory).
    1. **Vertical Scaling**--all database data stored on single database computer server.  Scale by adding hardware onto this single computer.  Vertical scaling is more expensive than scaling horizontally.
    1. **Horizontal Scaling**--database data is split up into overlapping smaller pieces called **shards**.  Each shard is stored on a separate, smaller database computer server called a **node**.  Nodes are connected by a network. Scale by connecting more nodes.

---

## ACID & BASE

- **Transaction**--unit of work performed by a DBMS on a database
- In relational databases, a transaction is a single SQL statement or a multi-(SQL)-statement. Relational databases are typically hosted on a single large database server.  This allows for ACID compliance.
    1. **Atomic**--each transaction either runs completely or, if there is an error, reverts back to the state before the transaction started.  A transaction is never partially completed.   All or nothing.
    1. **Consistent**--variously defined.  Before and after each transaction the database is in a valid state as determined by constraints, cascades, and triggers.  All future transactions are able to use this valid state.
    1. **Isolated**--transactions do not interact with other transactions.  The simplest way to guarantee this would be to implement **serializable isolation**, where each transaction is placed in a FIFO queue and only one transaction is run at a time.  Because this is slow, RDBMS actively moderate concurrent transactions.  Most importantly, the RDBMS prevents two transactions from writing (CUD) the same data at the same time.  The RDBMS will lock out all other transactions that need to CUD with the same data until the current transaction completes.  There are multiple levels of isolation that describe to what extent reads are isolated.  There are various isolation implementations, which may use some combination of locks, multiversion concurrency control (MVCC), snapshot isolation, etc.
    1. **Durable**--data in database persists after transaction has run, even if a computer crashes shortly after the transaction.  I.e. after each transaction, the database is saved into the computer server's non-volatile memory (i.e. disk/flash).
- NoSQL databases are typically hosted on a distributed network of database servers (nodes).  No single node has all the data and no single node is responsible for all transactions. This distributed network architecture prevents ACID compliance, but allows for BASE compliance. The acronym is contrived, and the most important term is the "eventually consistent".
    1. **Basic Availability**--reading and writing operations (CRUD) are available as much as possible, but might not be consistent.  This is often configurable.
    1. **Soft state**--more or less the same thing as eventually consistent 
    1. **Eventually consistent**--not necessarily the same definition as "consistent" in ACID.  Writes (CUD) are made on a single node and then that change is quickly passed to other nodes in the network.  If we wait a bit after writes (CUD) all nodes in the database will become "consistent" and all reads would return the same results.  Until consistency is achieved, there will be some nodes that contain conflicting data.  NoSQL DBMS must officiate these conflicts using timestamps.
- BASE compliant databases will have conflicting data at times.  This will cause inconsistent reads. Pretend we have two nodes, NodeA and NodeB.
    1. NodeA x=5.  NodeB x=5.
    1. NodeA receives instructions to add 20 to x. x=5+20=25.
    1. A second later, NodeB receives instructions to add 100 to x.  x=5+100=105.
    1. If we read x at this moment in time,  we may get 25 or 105 depending on the node we read from.
    1. 5 seconds later NodeA and NodeB try to sync with each other, but have conflicting data.  Because NodeA actually made the change 1 second before NodeB the NoSQL DBMS declares NodeA is correct, x=25.  Nodes are synced.
    1. NodeB adds 100 to x.   x=25+100=125.
    1. 5 seconds later NodeA and NodeB sync and become consistent.  x=125.

---

# DBMS

---

## Common RDBMS

- **Relational Database Management System (RDBMS)**--software that allows users to CRUD data stored in a relational database.  Users command the RDBMS to CRUD data with SQL.

![](images/rdbms.png)

- RDBMS can either follow a file-based or client-server model
    1. **File-based**--database files are accessed directly from the hard drive.  Similar to CRUDing with MS Excel. MS Access and SQLite are file-based.
    1. **Client-server**--functionality split into two distinct software programs.  *Server software* is directly responsible for CRUD.  *This is the RDBMS software (e.g. MS SQL Server).*  The computer (or network of computers) that run this software is called the *server*.  *Client software* provides a user interface to pass requests to the server software in the form of SQL commands (e.g. SQL Server Management Studio).  The server and client software can be run on the same computer, but more often are run on different computers within a network (LAN or the internet).  Server software must be configured before databases can be used.  Most RDBMS use the client-server model.
    
![](images/rdbms_server.png)

The most common RDBMS are:

Name | Release Year | License Type | Model | Pros, Cons, and Use Cases
--- | --- | --- | --- | ---
Oracle Database | 1979 | Commercial | Client-server | Enterprise scale. Extremely  customizable.  The most complex and thus the steepest learning curve.
IBM Db2 | 1983 | Commercial | Client-server | Enterprise scale.  Very customizable.
Microsoft SQL Server | 1989 | Commercial | Client-server | Enterprise scale.  Uses SQL flavor called Transact (T) SQL.  Integrates well with MS products.
Microsoft Access | 1992 | Commercial | File-based.  File extension often ".accdb". | Good for very, very, small databases (2 GiB size limit).  Allows non-technical users to create relational databases. MS has slowly tried to phase this product out.
MySQL | 1995 | Open source-ish | Client-server | Simple setup compared to other client-server RDBMS.   Less customizable than other RDBMS.  Less standard SQL grammar used.  Fast for read-heavy operations.  Often used for websites.  Commercial version now owned by Oracle.  
PostgreSQL | 1996 | Open source | Client-server | Enterprise scale.  "The world's most advanced open source relational database."  Most closely adheres to SQL standards of any RDBMS.
SQLite | 2000 | Open source | File-based.  File extension often ".sqlite3", ".sqlite", or ".db". | Simple and lightweight.  Embedded into computer, phone, car, etc., applications.   Database size limit is determined by the non-volatile memory of the device as the SQLite software can support databases around 250 TiB.  SQLite is bad when applications accessing the database are connected across a network or when many users need concurrent write access.  SQLite works well for everything else.
MariaDB | 2009 | Open source | Client-server | When Oracle purchased MySQL many in the open source community were concerned.  The open source version of MySQL was forked and renamed MariaDB.  Still very similar to MySQL and also often used for websites.

---

## Common NoSQL DBMS

- There are also many NoSQL DBMS.  Popular ones include:

Name | Release Year | License Type | Model | Pros, Cons, and Use Cases 
--- | --- | --- | --- | ---
Neo4j | 2007 | Open source-ish | Graph | Most popular graph DBMS
Apache Cassandra | 2008 | Open source | Wide column | Most popular wide column DBMS
MongoDB | 2009 | Open source-ish |  Document | Most popular document DBMS.  Stores binary JSON documents. 
Redis | 2009 | Commercial | Key-value | Most popular key-value DBMS.  Often used for volatile memory.
Elastic Search | 2010 | Open source-ish | Document | Originally only a search engine, but evolved into a full NoSQL DBMS

- Note that open source and commercial licenses exist on a spectrum

---

## Choosing DBMS

- Most organizations already use a DBMS, but do occasionally switch DBMS vendors.  New projects also may get to choose a new DBMS.  If unsure whether to use RDBMS or a NoSQL DBMS it is often advisable to choose a RDBMS.
- NoSQL databases vary in organization (key-value, document, column-store, or graph).  Each organizational model of NoSQL database excels at specific use case.  Many large tech companies with "big data" rely on NoSQL databases with horizontal scaling.
- Unfortunately, most NoSQL databases are not ACID compliant.  BASE DBMS are not suitable for financial transactions and other purposes where consistent reads are critical.
- RDBMS are ACID compliant. Also, when data can be stored in relational databases it provides a logical structure that is typically easier for humans to understand and query.
- Furthermore, RDBMS have borrowed functionality from NoSQL document databases.  Most RDBMS now support binary JSON.  A database created with a RDBMS can even be used in a non-relational way.  When this occurs the database is BASE compliant, can be scaled horizontally, and is similar to a NoSQL document database.   This involves treating the database like a collection of independent documents instead of a collection of related tables.
- Which RDBMS to choose depends on a whole host of factors.  What are project needs?  What is our budget?  What does our organization already use elsewhere?  Which RDBMS do our employees have experience with? Do we want to use an open source product?  Etc.
- The last decision we'll cover is how to host the database server.  Options include:
    1. Organization manages both database server hardware and RDBMS server software.  Called "on-premise".
    1. Third-party paid to manage database server hardware while organization manages RDBMS server software.  Called "virtual machine deployment" or "infrastructure as a service (IaaS)".  Cloud providers include Amazon, Microsoft, Google, and IBM.
    1. Third-party paid to manage both the database serve hardware and the RDBMS server software.  Called "database as a service (DBaaS)".  The biggest names are once again Amazon, Microsoft, Google, and IBM.  However, there are many more including Oracle and EnterpriseDB.

---

## SQL Clients

**SQL Client**--software that passes SQL commands to a RDBMS.  For database administrators and computer programmers this typically involves either an SQL shell or SQL IDE.
 
1. **SQL Shell**--SQL client software that sends SQL commands using a command-line interface.  SQL statements can be passed one at a time through the shell to the RDBMS.  Analogous to the Python interactive interpreter.  Shell programs can also pass plaintext SQL scripts to the RDBMS.  These use a .sql file extension.  Analogous to running .py scripts.  Scripts are good for program automation.  Common SQL shells include:
    - sqlite3.exe for SQLite
    - MySQL Shell for MySQL
    - psql for PostgreSQL
    - sqlcmd for MS SQL Server
1. **SQL IDE**--SQL Integrated Development Environment.  SQL client software with a GUI that can make it easier to connect to a RDBMS, run SQL statements, and visualize the structure of a database.  Analogous to R-Studio IDE or VS Code IDE. There are many SQL IDEs out there.  Some are free while some are paid for.  Some IDEs are specific to a particular RDBMS while others are cross platform and work for all major RDBMS.
   - SQL IDEs tailored to a single RDBMS:
        - DB Browser for SQLite
		- SQL Server Management Studio for MS SQL Server
        - MySQL Workbench for MySQL
        - Oracle SQL Developer for Oracle
        - pgAdmin for PostgreSQL
   - SQL IDEs that are free and cross platform:
        - DBeaver (most popular in this category)
        - SQuirrel
        - Toad
        - Heidi
    - SQL IDEs that integrate well with Python scripting:
        - JetBrains Data Grip (most popular in this category)
        - MS VS Code with extensions
        - Jupyter Lab with extensions

---

### IPython-SQL for SQLite

- To practice SQL statements we will turn Jupyter Lab into a basic SQL IDE
- `ipython-sql`--Jupyter Lab extension that allows us to run SQL statements from code cells.  We turn each code cell into an SQL cell using the "cell magic" command `%%sql`.  More information on `ipython-sql` can be found by following the link provided in the learning resources.
- The following few code cells are not SQL statements.  They will load `ipython-sql` into the Jupyter notebook. 
- We change a configuration setting to prevent certain feedback from printing each time an SQL statement is run
- After every SQL statement `ipython-sql` will automatically print the databases we are connected to.  The database preceded by an asterisk is the one that the SQL statement was sent to.
- While practicing SQL statements in our Jupyter SQL IDE we will use the SQLite RDBMS.  There are two reasons for this:
    1. SQLite does not require server configuration prior to use unlike other RDBMS
    1. SQLite is already embedded in the Python program so we do not have to download and install it 
- Lastly, we connect to an existing database.  If this is the first time running this command, it will create the database in the location specified by the relative file path.  This is used in place of the `CREATE DATABASE` SQL statement.

In [1]:
%load_ext sql

In [2]:
%config SqlMagic

SqlMagic(Magics, Configurable) options
------------------------------------
SqlMagic.autocommit=<Bool>
    Set autocommit mode
    Current: True
SqlMagic.autolimit=<Int>
    Automatically limit the size of the returned result sets
    Current: 0
SqlMagic.autopandas=<Bool>
    Return Pandas DataFrames instead of regular result sets
    Current: False
SqlMagic.column_local_vars=<Bool>
    Return data into local variables from column names
    Current: False
SqlMagic.displaylimit=<Int>
    Automatically limit the number of rows displayed (full result set is still
    stored)
    Current: None
SqlMagic.dsn_filename=<Unicode>
    Path to DSN file. When the first argument is of the form [section], a
    sqlalchemy connection string is formed from the matching section in the DSN
    file.
    Current: 'odbc.ini'
SqlMagic.feedback=<Bool>
    Print number of rows affected by DML
    Current: True
SqlMagic.short_errors=<Bool>
    Don't display the full traceback on SQL Programming Error
    Current: True
SqlMagic.style=<Unicode>
    Set the table printing style to any of prettytable's defined styles
    (currently DEFAULT, MSWORD_FRIENDLY, PLAIN_COLUMNS, RANDOM)
    Current: 'DEFAULT'

In [3]:
%config SqlMagic.feedback=False

In [4]:
%sql sqlite:///databases/db_ex.db

'Connected: @databases/db_ex.db'

---

# Relational Databases

---

## Tables

- Different people use different terminology

SQL Term | Relational Database Term | Description
--- | --- | ---
Row | Record or tuple | Represents a single item/element/thing.  Called a feature in GIS.
Column | Attribute, attribute field, field | An attribute of the item.  Called a variable in statistics.
Table | Relation | Set of columns and rows.  The term set is used as the order of columns and rows does not matter and rows and columns do not repeat.

- **Header**--field name.  The first row of a table contains headers.
- **Cell**--intersection of single row and single column.  Contains a value.
- **NULL**--value that may be placed within a cell to represents the absence of data
- Table example:

Header | Header | Header
--- | --- | --- 
ID1 | Data | Data
ID2 | Data | Data
ID3| Data | NULL

---

## Keys

- When MS Excel, Google Sheets, or Python Pandas wants to find a single cell it uses a column header and a row header (sometimes called a row label or row index).   E.g. in a spreadsheet program we can find the third cell down in the first column by specifying "A3".  Because each column letter and each row number is unique we can use this notation to find any cell in the table!
- However, RDBMS do not have predefined column and row headers.  To get unique column headers we must choose unique column names when a table is created.  Simple.
- RDBMS rows do not have headers in the same way that columns do.  We must create a column to hold these row "headers", these "names", these values that will uniquely identify each row.
- **Primary key**--the field where every record has a unique identifying cell value.  Allows us to identify records.
- Primary key cell values must:
    1. Be unique.  Cell values never repeat within that column.
    2. Never change.  It is best not to have the primary key be a name as these may change.
    3. Never be  NULL
- For these reasons, primary key cell values are almost always positive integers (1,2,3,4...)
- Each table below has a primary key:

![](images/key.png)

- **Foreign key**--a field in a given table that acts as the primary key in a different (foreign) table
- In the Fruits Table above, Color ID is just another field, but it is the primary key in the Colors Table
- There are other types of keys:
    1. **Super key**--one or more fields that could potentially act as the primary key.  Only one is usually chosen as the primary key.  The un-chosen keys are called **alternate keys**.
    1. **Compound/concatenate/composite key**--two or more fields that, when used together, uniquely ID each record and act as the primary key
        -  E.g. we may ID a US county using State and County fields.  Just county couldn't be used as a primary key as county names can be the same in different states.  However, within the same state, there are no county names that repeat.
    1. **Logical Key**--primary key where the values are common names instead of numbers.  Because of the potential to have non-unique names or names that change, logical keys are not often used as the primary key field. However, they are commonly used to search for a record in a table.
        - E.g. in a table of songs it may be song name.  In a table of people it may be first and last name.  In a table of emails it is email address.
- There is no universal convention for choosing names for tables and columns.  The most important thing is that team members follow the same convention, whatever that is.  Here is one common convention:
    - Table name is lowercase and singular (some prefer plural).  The table name represents the subject of the table. 
    - Primary key header is lowercase `id` (some prefer to prefix with table subject)
    - The primary key cell values are positive integers (1,2,3,4, etc)
    - Foreign key header is the singular table name of the foreign table + underscore + id (all lowercase)
    - Field that describes what the subject of the table is uses the header, `name` (some prefer to prefix with subject)
    
![](images/naming_conventions.png)

- I didn't use this naming convention in many examples as I thought being more descriptive with names would be helpful for learning.

---

## Normalization

- While we could store data in one giant table this is not very efficient.   If there were millions of records this table may be slow to work with. 
- The table below shows a table with lots of repeated cell values, such as the string "Rock" in the "Genre" column.  This is termed "vertical repetition".  Vertical repetition of strings and data types that take up a lot of storage space is bad.

![](images/itunes_ui.png)

- Relational databases solve this problem by creating multiple smaller, connected tables.  "Compression by connection."  These smaller tables still have vertical repetition, but the values that repeat will be integers (keys) that do not take up much memory.  "References replace repetition."
- **Normalization**--the process of building connected data tables that follow certain rules.  There are 3 (or more) levels of "Normal Form" that make the relational database increasingly efficient.
1. **First Normal Form**--within each table:
	1.  Primary key
	2.  No duplicate records
	3.  Field names do not repeat and are not NULL
	4.  Data type does not change within the same field
		-  E.g.  D.O.B. field does not have "Frank" as a value in a cell
	5. **Atomic**--each cell only contains one value 
		- E.g. a D.O.B. cell should not have multiple dates
2. **Second Normal Form**
	1. Be in First Normal Form
	2. Not have **Partial Dependency**
3. **Third Normal Form**
	1. Be in Second Normal Form
	2. Not have **Transitive Dependency**
- I don't fully understand the levels of dependencies ([and that's...OK](https://youtu.be/xNx_gU57gQ4)).  The gist is that all the attribute fields should be directly related (for a lack of a better word) to the primary key.
- The table below is a listing of Harry and Ron's course load.  It has problems.
 
Student ID | Student Name | Teacher ID | Teacher Name | Class Name
--- | --- | --- | --- | ---
S1 | Harry | T1, T2, T3 | Hagrid, Sprout, Snape | Magical Creatures, Magic Botany, Defense ADA 
S2 | Ron | T3, T4 | Snape, Slughorn | Potions, Defense ADA

-  We'll put it in first normal form.  To make it atomic we must create new rows and split up lists.  However, doing so gets rid of a primary key field (which was Student ID).  We'll create a new primary key field.  We cast Al-a-ka-first-normal-form!!! 

Primary Key | Student ID | Student Name | Teacher ID | Teacher Name | Class Name
--- | --- | --- | --- | --- | --
1 | S1 | Harry | T1 | Hagrid |Magical Creatures
2 | S1 | Harry | T2 | Sprout | Magic Botany
3 | S1 | Harry | T3 | Snape | Defense ADA
4 | S2 | Ron | T4 | Slughorn | Potions
5 | S2 | Ron | T3 | Snape | Defense ADA

- Much better, but still not perfect.  There is a lot of vertical repetition of strings like "Harry" and "Snape", that takes up memory space.
- To put this into second or third normal form we'd need separate tables for students, teachers, classes, and student course load, and connect them all together with primary and foreign keys! 
- In general, if a column has a lot of vertical repetition of strings we often move it to its own table and that column becomes the new logical key.  We cast Al-a-ka-second-or-third-normal form!!!


Student Table.  Student Name had vertical repetition of string values.  Split into own table and became logical key.

Student ID | Student Name
--- | --- 
S1 | Harry 
S2 | Ron

Teacher Table.  Teacher Name had vertical repetition...split...became logical key.

Teacher ID | Teacher Name
--- | ---
T1 | Hagrid
T2 | Sprout
T3 | Snape
T4 | Slughorn

Class Table.  Class Name had vertical repetition...split...became logical key.

Class ID | Class Name | Teacher ID
--- | --- | ---
C1 | Magical Creatures | T1
C2 | Magic Botany | T2
C3 | Defense ADA | T3
C4 | Potions | T4

Connection Table

Student ID | Class ID
--- | ---
S1 | C1
S1 | C2
S1 | C3
S2 | C3
S2 | C4

- Note how our long strings are only ever written once in the entire database!  "References replace repetition."
- The way we choose to split up tables depends on the relationship between the subjects of tables

---

## Relationships

- **Relationship**--how the subjects in one table relate to subjects in another table
- We are primarily concerned with the following 4 relationships:

Relation | Symbology | Example
--- | --- | ---
One to One | 1-1 | Customer to Customer ID
One to Many | 1-n | Order to Products
Many to One | n-1 | Products to Order
Many to Many | n-n | Customers to Products

- As seen the example above, 1-n  and n-1 relationships are the same thing, it's just a matter of perspective
- **Entity**--another term for a table
- **Entity Relationship Diagram (ERD)**--visual representation of table relationships within a database.   Each block/rectangle in an ERD represents a table and the block rows actually represent all the attribute fields. 
- ERDs may only use lines to connect tables, or they may include more information in the form of relational symbols.  The image below maps symbols to their meanings. Note how shapes intuitively correspond to meanings.

![](images/erd_relationships.png))

- In the following ERD, notice the PK (Primary Key) and FK (Foreign Key) designations next to certain fields.  The following ERD can be read as "customers can make zero or more orders, while orders are made by one and only one customer.  Each order contains one or more products, while each product may be in zero or more orders."

![](images/erd.png)

- **Cardinality**--refers to the number of associations between entities.  I.e. how many tables a given table is related to.

---

## Schema

- **Schema**--plural schemas or schemata.  Diagram or framework.  Term takes on different meanings when used in different areas of computer science (e.g. XML, APIs, and databases).
- **Database schema**--term takes on different meanings in different RDBMS.  It may refer to a visual diagram of the database similar to an ERD, textual specifications of the database, or even refer to the entire database.  Generally, a database schema controls how the database is initially constructed and how it can be modified and added in the future.   Includes which tables are in the database, how tables are related to each other (through primary and foreign keys), which type of data each field holds, field precision, field scale, and indexes.
- **Field data type**--data storage format for a particular field.  Similar to MS Excel cell types (whole numbers, decimal numbers, text, TRUE/FALSE, date, currency, and N/A).  Different RDBMS use different data types.  Must look at documentation for each RDBMS.
- **Field precision**--also called field length.  The number of characters that can be stored in a given field.
    - E.g. number of characters in a string or number of digits in an integer
- **Field scale**--if the field holds real numbers, it is the amount of decimal places that can be stored
- The following image shows a visual representation of a database schema.  It is very similar to an ERD, but commonly includes information on field data type and precision. 

![](images/schema.png)

---

## JOIN 
  
- So far we've covered how data is stored in separate tables and how tables are related with primary and foreign keys.  
- Though it is more efficient to store data in separate tables, we often want to view certain attributes of the data together in a single table
- Program user interfaces do this automatically for us all the time.  For example, iTunes internally uses the SQLite RDBMS.  An iTunes database is made up of separate tables like an Albums table, Genre table, and Artists table.  It joins them all together for us to view in our iTunes Library table.

![](images/itunes_ui.png)

- **Join**--combine multiple tables into one
- Join is a type of SQL statement used to command a RDBMS.  We often write JOIN with all uppercase letters as this is common for SQL keywords.
- Joining does not change the underlying data in the database, nor the structure of it.  The resulting table is a new, temporary, view of our data.
- There are multiple ways to join tables. We will break it up into three different categories:
    1. Cross join (no relationships and no keys used)
    1. Join for 1-1 and 1-n relationships (keys used)
    1. Join for a n-n relationships (keys used)
- We will also jump into SQL a section early and provide SQL examples so that we can reinforce the concepts of relations, keys, and joins
- Lastly, note we are using examples that join TWO TABLES tables.  We can join THREE or more tables together, but depending on type of join used, it may create additional complexity to worry about!

---

### CROSS JOIN
 
- **CROSS JOIN**--combines each record from one table with each record from another table in every possible combination.  It does not use table relationships or keys at all!
- The result table has no NULL values.
- All cell values from the original tables are represented in the result table
- CROSS JOIN is rarely used as records in result table often have little practical significance
- CROSS JOIN can get out of hand quickly as: 
    - $\text{number of records in result table} =  \text{number of records table A}\cdot \text{number of records table B}$
- The result table below has 4 x 3 = 12 records:

![](images/join_cross.png)

---

#### CROSS JOIN SQL

- CROSS JOIN SQL syntax is similar to other JOINs
- RDBMS typically have their own keyword for `CROSS JOIN` to indicate to the reader that we intend to perform a CROSS JOIN. However, the `INNER JOIN` (or `JOIN`) SQL keyword can actually be used to perform a CROSS JOIN and returns the exact same results.
- The difference between a true INNER JOIN and a CROSS JOIN is that the  `ON` statement is left out in CROSS JOIN.   `ON` is left out because CROSS JOIN does not rely ON keys.

```sql
SELECT *
FROM table_a
CROSS JOIN table_b
```

---

**EXAMPLES**

**Drop Tables**

In [5]:
%%sql

DROP TABLE IF EXISTS fruit;
DROP TABLE IF EXISTS color;

 * sqlite:///databases/db_ex.db

[]

**Create Tables and Insert Records**

In [6]:
%%sql

CREATE TABLE color(
    id INTEGER PRIMARY KEY,
    name VARCHAR(20)
);

INSERT INTO color(name)
VALUES 
    ('Red'),
    ('Orange'),
    ('Yellow');


SELECT *
FROM color;

 * sqlite:///databases/db_ex.db

[(1, 'Red'), (2, 'Orange'), (3, 'Yellow')]

In [7]:
%%sql

CREATE TABLE fruit(
    id INTEGER PRIMARY KEY,
    name VARCHAR(20)
);

INSERT INTO fruit (name)
VALUES 
    ('Apple'),
    ('Cherry'),
    ('Orange'),
    ('Lime');

SELECT *
FROM fruit;

 * sqlite:///databases/db_ex.db

[(1, 'Apple'), (2, 'Cherry'), (3, 'Orange'), (4, 'Lime')]

**CROSS JOIN**

In [8]:
%%sql

SELECT *
FROM fruit
CROSS JOIN color;

 * sqlite:///databases/db_ex.db

[(1, 'Apple', 1, 'Red'),
 (1, 'Apple', 2, 'Orange'),
 (1, 'Apple', 3, 'Yellow'),
 (2, 'Cherry', 1, 'Red'),
 (2, 'Cherry', 2, 'Orange'),
 (2, 'Cherry', 3, 'Yellow'),
 (3, 'Orange', 1, 'Red'),
 (3, 'Orange', 2, 'Orange'),
 (3, 'Orange', 3, 'Yellow'),
 (4, 'Lime', 1, 'Red'),
 (4, 'Lime', 2, 'Orange'),
 (4, 'Lime', 3, 'Yellow')]

---

### 1-1 & 1-N JOINs

- The following JOINs are used with 1-1 or 1-n table relationships
    1.  INNER JOIN. 
    2.  LEFT (OUTER) JOIN
    3.  RIGHT (OUTER) JOIN
    4.  FULL (OUTER) JOIN
- Our examples will use the same fruit  table and color table seen above.  Each record in the color table may be related to 1 or more records in the fruits table.  This makes it a 1-n relationship.

---

#### INNER JOIN

- **(INNER) JOIN**--only returns records that have matching values in both tables
- It does not create any NULL values, however it does leave records behind

![](images/join_inner.png)

---

##### INNER JOIN SQL

- INNER JOIN is the default in databases.  If we just use the `JOIN` keyword, it will be an INNER JOIN.  However, We'll explicitly write `INNER JOIN` for clarity.
- Here is an INNER JOIN SQL statement:

```sql
SELECT *
FROM table_a 
INNER JOIN table_b
ON table_a.foreign_key = table_b.primary_key
```

- An INNER JOIN is equivalent to:
    1. Performing CROSS JOIN
    1. Filter our results with the `ON` clause to only include records with matching keys.  It is similar to a `WHERE` clause in this way.
- Table order is NOT important for INNER JOIN:
    - We can specify which *columns* we want in which order in the result table using the `SELECT` clause.   In the above code we do not do this and instead just put `*`.   If we do not specify, then which *table* we put first in the SQL statement changes the arrangement of the *columns* in the result table.  In practice, we usually specify which columns we want in the result table in which order. Then, the order does not matter at all.
    -  We can specify how our *rows* are sorted in the results table with an `ORDER BY` clause.  In the above code we do not do this.  If we do not do this, then which *table* we put first in the SQL statement sometimes changes the arrangement of the *rows*.  In practice, we usually specify how our rows are sorted in the result table.  Then the order does not matter at all.
    - The order we list the table after the `ON` has absolutely zero affect on the result table.  However, we do need to ensure the table and that table's key are kept together.  This is specified with dot notation.
    - Some programmers may have a personal preference on what order they write tables and keys.  As shown in the examples, I prefer to write the table representing the "many" (has the foreign key) first in the statement.  When used with `*`, it places the "many" subject/logical key to the left and matching foreign and primary keys next each other.

---

**EXAMPLES**

**Drop Tables**

In [9]:
%%sql

DROP TABLE IF EXISTS fruit;
DROP TABLE IF EXISTS color;

 * sqlite:///databases/db_ex.db

[]

**Create Tables and Insert Records**

In [10]:
%%sql

CREATE TABLE color(
    id INTEGER PRIMARY KEY,
    name VARCHAR(20)
);

INSERT INTO color(name)
VALUES 
    ('Red'),
    ('Orange'),
    ('Yellow');

SELECT *
FROM color;

 * sqlite:///databases/db_ex.db

[(1, 'Red'), (2, 'Orange'), (3, 'Yellow')]

In [11]:
%%sql

CREATE TABLE fruit(
    id INTEGER PRIMARY KEY,
    name VARCHAR(20),
    color_id INTEGER REFERENCES color(id)
);

INSERT INTO fruit (name, color_id)
VALUES 
    ('Apple', 1),
    ('Cherry', 1),
    ('Orange', 2),
    ('Lime', 4);

SELECT *
FROM fruit;

 * sqlite:///databases/db_ex.db

[(1, 'Apple', 1), (2, 'Cherry', 1), (3, 'Orange', 2), (4, 'Lime', 4)]

**INNER JOIN**

In [12]:
%%sql

SELECT *
FROM fruit 
INNER JOIN color
ON fruit.color_id = color.id;

 * sqlite:///databases/db_ex.db

[(1, 'Apple', 1, 1, 'Red'),
 (2, 'Cherry', 1, 1, 'Red'),
 (3, 'Orange', 2, 2, 'Orange')]

---

#### LEFT JOIN

- **LEFT (OUTER) JOIN**--returns all matching records (like INNER JOIN) and also any unmatched records from the left table (first table mentioned)
- Any unmatched record creates a NULL value
- Note that the order the tables are mentioned affects records included in the result table

![](images/join_left.png)

---

##### LEFT JOIN SQL

- LEFT JOIN SQL statements are very similar to INNER JOIN.  We use `LEFT JOIN` instead of `INNER JOIN`.

---

**EXAMPLES**

**LEFT JOIN**

- Fruit table written first.  Color table written second.  Yellow record is missing.

In [13]:
%%sql

SELECT *
FROM fruit 
LEFT JOIN color
ON fruit.color_id = color.id;

 * sqlite:///databases/db_ex.db

[(1, 'Apple', 1, 1, 'Red'),
 (2, 'Cherry', 1, 1, 'Red'),
 (3, 'Orange', 2, 2, 'Orange'),
 (4, 'Lime', 4, None, None)]

**LEFT JOIN**

- Color table written first.  Fruit table written second.  Lime record is missing.

In [14]:
%%sql

SELECT *
FROM color 
LEFT JOIN fruit
ON fruit.color_id = color.id;

 * sqlite:///databases/db_ex.db

[(1, 'Red', 1, 'Apple', 1),
 (1, 'Red', 2, 'Cherry', 1),
 (2, 'Orange', 3, 'Orange', 2),
 (3, 'Yellow', None, None, None)]

---

#### RIGHT JOIN

- **Right (OUTER) JOIN**--returns all matching records (like INNER JOIN) and also any unmatched records from the right table (second table mentioned)
- Any unmatched record creates a NULL value  
- The order the tables are mentioned affects records included in the result table
- Also note that we can turn a left into a right (and vice versa) by switching the order tables are listed.  The column layout will be different though.  
- Most programmers prefer the layout of the LEFT JOIN.  Therefore, RIGHT JOIN is rarely used.

![](images/join_right.png)

- *Note that SQLite does not have a RIGHT JOIN SQL statement*

---

#### FULL JOIN

- **FULL (OUTER) JOIN**--returns all matching records (like INNER JOIN) and also any unmatched records from the left or right tables
- Creates the most NULL values, but also no record left behind
- Like INNER JOIN, the order tables are written in the SQL statement order does NOT affect which records are included in the result table. 
- Like INNER JOIN, for formatting reasons, our examples writes the "many" table (table with foreign key) first

![](images/join_full.png)

- *Note that SQLite does not have a FULL JOIN SQL statement.  The same functionality can be implemented, but requires multiple SQL statements.*

---

#### 1-1 & 1-N Summary

- The following Venn diagrams illustrate which records are included in the result table when two input tables are combined with different JOINs:

![](images/join_types.jpg)

- The following tables summarizes key characteristics of JOINs when TWO TABLES are joined:

JOIN TYPE | NULL Values Created? | Records Left Behind? | Table Order Affects Records Included in Result Table?
--- | --- | --- | ---
INNER JOIN | No | Yes | No
LEFT JOIN | Yes | Yes | Yes
RIGHT JOIN | Yes | Yes | Yes
FULL JOIN | Yes | No | No

---

#### Ambiguous Results?

- Spoiler...no
- The below image shows two different JOINs.  

![](images/join_ambiguous.png)

- Luckily this is only hypothetical.  RDBMS software is smart enough not to do this.

---

#### Multi-JOINs

- **Multi-JOIN**--JOIN three or more tables together in a single SQL statement
- Multi-JOINs are common when tables are normalized
- Multi-JOIN queries can use a single join type more than once (e.g. INNER, INNER), or they can use multiple types (e.g. INNER, FULL).
- **Caution!  Mulit-JOINs are evaluated sequentially.  After each join, a temporary, intermediate result set is created.  When joining three or more tables the order tables are listed may effect the final result table.**  
- The only cases where table order does NOT matter is when:
    1. We use only INNER JOINs
    1. We use only FULL JOINs
- The implications of table order can be best visualized with Venn diagrams.  Note the multi-join with an INNER JOIN and a LEFT JOIN:

![](images/join_types_multi.png)

- Below we perform the same INNER JOIN we did before, but also INNER JOIN a vegetable table

![](images/join_multi.png)

---

##### Multi-JOIN SQL

- MUlti-JOIN SQL syntax is similar to other JOINs.  We add a JOIN clause for each additional JOIN performed.

```sql
SELECT *
FROM table_a 
INNER JOIN table_b ON table_a.foreign_key = table_b.primary_key
INNER JOIN table_c ON table_a_or_b.foreign_key = table_c.primary_key
```

---

**EXAMPLES**

**Drop Table**

In [15]:
%%sql

DROP TABLE IF EXISTS vegetable;

 * sqlite:///databases/db_ex.db

[]

**Create Table and Insert Records**

In [16]:
%%sql

CREATE TABLE vegetable(
    id INTEGER PRIMARY KEY,
    name VARCHAR(20),
    color_id INTEGER REFERENCES color(id)
);

INSERT INTO vegetable (name, color_id)
VALUES 
    ('Carrot', 2),
    ('Spinach', 4);

SELECT *
FROM vegetable;

 * sqlite:///databases/db_ex.db

[(1, 'Carrot', 2), (2, 'Spinach', 4)]

**Multi-JOIN**

In [17]:
%%sql

SELECT *
FROM fruit
INNER JOIN color ON fruit.color_id = color.id
INNER JOIN vegetable ON vegetable.color_id = color.id;

 * sqlite:///databases/db_ex.db

[(3, 'Orange', 2, 2, 'Orange', 1, 'Carrot', 2)]

---

### N-N JOIN

- We have talked about CROSS JOIN and JOINs for 1-1 and 1-n relationships
- Many to many (n-n) entity relationships are also common in relational databases
- When we have normalized tables and n-n relationships we can NOT perform joins like we do above.  We must use a connection table
- **Connection/Junction/Membership/Join Table**--a third, new table, that contains foreign keys referencing input tables
- The connection table will not always not have a primary key of its own because each record could be identified by a compound key (combination of foreign keys).
- The connection table enables us to write a one to many relationship between each input table and the connection table!
    - Each fruit is in the fruit table has only one record, but that fruit may be in the connection table many times
    - Each color is in the color table has only one record, but that color may be in the connection table many times

![](images/join_n_n.png)

- Thought of a different way, an n-n JOIN is like a CROSS JOIN with a connection table that filters which combinations of records we want.  The `ON` clause is similar to the `WHERE` clause in this way.
    - In the example, a CROSS JOIN result table would contain 12 records
    - Our connection tables specifies we only want to display 4 of the 12 records

---

#### N-N JOIN SQL

- Because the connection table allows us to write one to many relationships we use  15`INNER JOIN` keyword and similar syntax 

```sql
SELECT *
FROM table_a
INNER JOIN table_connection ON table_connection.foreign_key_a = table_a.primary_key
INNER JOIN table_b ON table_connection.foreign_key_b = table_b.primary_key
```

Alternative syntax:
```sql
SELECT *
FROM table_a
INNER JOIN table_b
INNER JOIN table_connection
ON table_connection.foreign_key_a = table_a.primary_key
AND table_connection.foreign_key_b = table_b.primary_key
```

---

**EXAMPLES**

**Drop Tables**

In [18]:
%%sql

DROP TABLE IF EXISTS fruit;
DROP TABLE IF EXISTS color;
DROP TABLE IF EXISTS connection;

 * sqlite:///databases/db_ex.db

[]

**Create Tables and Insert Records**

In [19]:
%%sql

CREATE TABLE color(
    id INTEGER PRIMARY KEY,
    name VARCHAR(20)
);

INSERT INTO color(name)
VALUES 
    ('Red'),
    ('Orange'),
    ('Yellow');

SELECT *
FROM color;

 * sqlite:///databases/db_ex.db

[(1, 'Red'), (2, 'Orange'), (3, 'Yellow')]

In [20]:
%%sql

CREATE TABLE fruit(
    id INTEGER PRIMARY KEY,
    name VARCHAR(20)
);

INSERT INTO fruit (name)
VALUES 
    ('Apple'),
    ('Cherry'),
    ('Orange'),
    ('Lime');

SELECT *
FROM fruit;

 * sqlite:///databases/db_ex.db

[(1, 'Apple'), (2, 'Cherry'), (3, 'Orange'), (4, 'Lime')]

In [21]:
%%sql

CREATE TABLE connection(
    fruit_id INTEGER,
    color_id INTEGER
);

INSERT INTO connection (fruit_id, color_id)
VALUES 
    (1, 1),
    (1, 3),
    (2, 1),
    (3, 2);

SELECT *
FROM connection;

 * sqlite:///databases/db_ex.db

[(1, 1), (1, 3), (2, 1), (3, 2)]

**N-N JOIN**

In [22]:
%%sql

SELECT fruit.name, connection.fruit_id, connection.color_id, color.name
FROM fruit
INNER JOIN connection ON connection.fruit_id = fruit.id
INNER JOIN color ON connection.color_id = color.id;

 * sqlite:///databases/db_ex.db

[('Apple', 1, 1, 'Red'),
 ('Apple', 1, 3, 'Yellow'),
 ('Cherry', 2, 1, 'Red'),
 ('Orange', 3, 2, 'Orange')]

---

# SQL

- **Structured Query Language (SQL)**--programming language used to command a RDBMS and CRUD.  Created in 1974.
- SQL is commonly broken up into 4 categories of uses, sometimes called "sub-languages".
    1. **Data Query Language (DQL)**--SQL statements to read/select data.  These are called queries.
    2. **Data Manipulation Language (DML)**--SQL statements to edit/modify data
    3. **Data Definition Language (DDL)**--SQL statements for creating and deleting tables, indices, users, etc.
    4. **Data Control Language (DCL)**--SQL statements to control who has permission to view/edit/delete certain tables/columns/rows/cells
- SQL became a standard of the American National Standards Institute (ANSI) in 1986, and of the International Organization for Standardization (ISO) in 1987.  Despite these standards, each RDBMS uses a different dialect/flavor of SQL.
- We will show many example SQL statements in this section.   Throughout these examples, try to imagine the shape of the data we are working with.  Is it the entire table, an entire column, a group of rows, or a single row?  Are we looping through each row in the table?  Are we focused on cell values in a specified column?  And what is being returned?

---

## Terminology

Example tables and SQL statement:

![](images/naming_conventions.png)

```sql
DELETE
FROM color
WHERE name = 'Red'
 ```
 
1. **Keywords**--words used in SQL statements that indicate the intent of the statement
	- E.g. `DELETE`, `FROM`, and `WHERE` are keywords
1. **Operator**--symbols that modify the logic of SQL statements.  Operators can be arithmetic (e.g. +), comparative (e.g. =), logical (e.g. AND), bitwise (&), or compound (assignment) (+=).
	- E.g. `=` is a comparative operator
1. **Function**--similar to a keyword, but parentheses contain function arguments (the function input)
    - E.g. `COUNT()`
1. **Identifier**--variable name for objects like tables or columns.  
	- E.g. `color` and `name` are identifiers
1. **Literals/constants**--values we write out. Could represent the value of a cell in a table.
	- E.g. `'Red'` is a string literal
1. **Clause**--chunk of SQL statement  made of keywords, operators, functions, identifiers, and literals
	- E.g. `DELETE`, `FROM color`, and  `WHERE name = 'Red'` are each their own clause
1.  **SQL Statement**--entire SQL sentence made of clauses that commands RDBMS to accomplish a task.  The entire example above is an SQL statement.
1. **Query**--SQL statement that uses the `SELECT` keyword. Queries do not modify the database. They only select records and return a result table.
1. **Result set/table**--query result returned to the user.  Typically, but not always, printed out as table.
1. **Dot notation**--specify column by writing the table name, a period, and then the column name.  Removes ambiguity when multiple tables have the same column names.  Join statements require dot notation.  Other SQL statements can optionally use dot notation.
    - E.g. `name` = `color.name`

---

## Style Guidelines

Style guidelines help users write code that others can easily read.  Some styling rules are mandatory and enforced by the RDBMS, but many are only convention.  Many guidelines are shared across other programming languages.

1. Keywords, operators, and functions are case INsensitive, but it is conventional use all uppercase:
    - E.g. `SELECT`
    - E.g. `IN`
1. Choosing identifier names:
    - Names must begin with a letter and may not end with an underscore
    - Avoid choosing keywords or operators as identifiers.  These are **"reserved"** for use by the RDBMS already.
    - Only use alphanumeric characters and underscores.  Avoid other symbols as these may cause errors, but rules vary by RDBMS.    
    - Avoid spaces. `snake_case`recommended when multiple words instead of dromedary  `camelCase` or bactrian `CamelCase`.
    - Avoid Hungarian notation with prefixes like `tbl_` or `col_`.
    - Never give a table the same name as one of its columns
    - For columns, use a singular name
    - For procedures, used a verb that describes the function of the procedure
1. **S**ingle quotation marks are used when writing **s**tring (and date) literals.  Some RDBMS also allow double quotes, but this is not standard SQL and NOT recommended. Note that string data is always stored with case information (at least for ASCII characters) and commands usually takes case into account.  However this may vary by command and RDBMS
	- E.g. `'Red'`
    - E.g. `Red' = 'red'` returns false
1. **D**ouble quotation marks are used for writing **d**atabase identifiers.  However, database identifiers only need to use quotes if they contain irregularities (which vary by RDBMS) like spaces, keywords, certain special characters, or capitalized letters.  In some RDBMS backticks or square brackets can also be used, but this is not standard SQL and NOT recommended.
	- E.g. `color` and `"color"` are both valid table names
    - E.g. `table color` is invalid, but `"table color"` is valid
1. **Insignificant whitespace**--spaces and newlines added to code that do not affect functionality of code.  Makes code easier to read.  Note that different programmers follow different conventions here.
    - Clauses with "root keywords" placed on new line and left aligned
    - `AND` or `OR` keywords also placed on new line, but indented 2 or 4 spaces
    - If root keywords have single argument, then keyword and argument may be included on same line.  However, if root keywords have multiple arguments, then each argument must be on its own line and indented 2 or 4 spaces.
    - Uses spaces and not tabs to indent.  Usually code editors automatically convert a press of the tab key to  spaces.
    -  If parentheses span multiple lines:
        - The opening parenthesis should terminate the line
        - The contents of the parentheses should be indented one level (2 or 4 spaces)
        - The closing parenthesis should be lined up under the first characters of the line that starts the multi-line construct.
1. Be explicit
    - Explicitly use `AS` to alias
    - Explicitly use the JOIN type such as `INNER JOIN` or `CROSS JOIN` instead of just `JOIN`
1. Use common table expressions instead of nested subqueries for derived tables
1. Line length limited to 80 characters.  Note that with modern code editors and large screen sizes some programmers prefer longer line limits such as 100.  Generally though, enforcing shorter lines produces more readable code and prevents confusing nested structures.
1. **SQL statement terminator**--a semicolon used to indicate the end of an SQL statement.  It is required if multiple SQL statements are passed to a RDBMS at the same time.  It is recommended (part of the SQL ANSI standard), but not always required, when a single SQL statement is passed.

---

**EXAMPLES**

**Whitespace**

In the following example, keywords are all caps, on their own line, and left aligned.  If multiple arguments, they are placed on their own line and indented.  `AND` is on its own line and indented.


```sql
SELECT 
    column_name, 
    column_name
FROM table_name
WHERE condition
    AND condition
LIMIT #;
```

**Parentheses**

In the following example the opening parenthesis ends the line, the contents of the parentheses are indented and the closing parenthesis is on its own line and at the indentation level of the first character of the line that starts the multi-line construct.

```sql
WITH alias_name AS (
    SELECT 
        column_name,
        column_name
    FROM table_name
    WHERE condition
        AND condition
    LIMIT #
);
```

---

##  Comments
- **Comments**--text not executed as an SQL statement by a RDBMS.  I.e. text ignored by RDBMS.  Used to explain the rationale, the "why", of complex SQL statements.  Can also be used temporarily cancel out lines of code while debugging SQL statements. 
- Comments can be on their own line, "in-line", or "multi-line"
- Anything after a double hyphen, `--`, on that line is treated as a comment
- Multi-line comments start with `/*` and end with `*/`

```sql
-- This is comment.  The double hyphen indicates it is a comment.
```

```sqlite
CREATE DATABASE database_name;  -- This is an in-line comment.
```

```sql
/* This is a multi
line comment
*/
```

*`ipython-sql` uses `--` in some non-SQL commands.  It is best to avoid single line comments with `--` when using `ipython-sql`.*

---

**EXAMPLES**

In [23]:
%%sql

-- This is comment.  The double hyphen indicates it is a comment.

 * sqlite:///databases/db_ex.db

[]

In [24]:
%%sql

/* This is a multi
line comment
*/

 * sqlite:///databases/db_ex.db

[]

---

## DDL Keywords

---

### CREATE DATABASE
`CREATE DATABASE`--create new database
```sql
CREATE DATABASE database_name;
```

- *Note that in this Jupyter notebook we must use the SQL magic command to create and connect to a database.  This was done in the RDBMS section.*

---

### DROP DATABASE
`DROP DATABASE`--delete database
```sql
DROP DATABASE database_name;
```

- *Note that SQLite does not have a DROP DATABASE SQL statement. Instead, we must delete the database file from the computer normally with the file explorer or a terminal program.*

---

### BACKUP DATABASE
`BACKUP DATABASE`--create a copy of the existing database 
```sql
BACKUP DATABASE database_name
TO DISK = 'path/filename';
```

`WITH DIFFERENTIAL`--back up the parts of the database that have changed since the last full database backup
```sql
BACKUP DATABASE database_name
TO DISK = 'path/filename'
WTIH DIFFERENTIAL;
```

---

### CREATE TABLE
`CREATE TABLE`--create new table by specifying table schema. May include table name, field names, field data type, field precision, and field scale.  Conventionally each column name indented 4 spaces.

```sql
CREATE TABLE table_name (
    column_name_a data_type(field_precision),
	column_name_b data_type(field_precision)
);
```

`IF NOT EXISTS`--create table if it does not already exist. Helps avoids errors.
```sql
CREATE TABLE IF NOT EXISTS table_name (
    column_name_a data_type(field_precision),
	column_name_b data_type(field_precision)
);
```

`CREATE TABLE AS`--create table using existing table as template. This statement is typically preferred over the `SELECT INTO` statement, which performs a similar task.
```sql
CREATE TABLE new_table_name AS
    SELECT column_name_a, column_name_b
	FROM old_table_name;
```

We'll create the following two tables:

![](images/naming_conventions.png)

---

**EXAMPLES**

**Drop Tables**

In [25]:
%%sql

DROP TABLE IF EXISTS fruit;
DROP TABLE IF EXISTS color;

 * sqlite:///databases/db_ex.db

[]

**`CREATE TABLE`**

In [26]:
%%sql

CREATE TABLE color(
    id INTEGER,
    name VARCHAR(20)
);

 * sqlite:///databases/db_ex.db

[]

In [27]:
%%sql

SELECT *
FROM color;

 * sqlite:///databases/db_ex.db

[]

In [28]:
%%sql

CREATE TABLE fruit(
    id INTEGER,
    name VARCHAR(20),
    color_id INTEGER
);

 * sqlite:///databases/db_ex.db

[]

In [29]:
%%sql

SELECT *
FROM fruit;

 * sqlite:///databases/db_ex.db

[]

---

### DROP TABLE
`DROP TABLE`--delete entire table
```sql
DROP TABLE table_name;
```

`DROP TABLE IF EXISTS`--delete entire table
```sql
DROP TABLE IF EXISTS table_name;
```

---

### TRUNCATE TABLE
`TRUNCATE TABLE`--delete all rows.  Table itself remains.
```sql
TRUNCATE TABLE table_name;
```

- *Note that SQLite does not have a TRUNCATE TABLE statement.  Instead, we can use the DELETE statement to delete all  rows, leaving the table.*

In [30]:
%%sql

DELETE
FROM color;

 * sqlite:///databases/db_ex.db

[]

In [31]:
%%sql

SELECT *
FROM color;

 * sqlite:///databases/db_ex.db

[]

---

### ALTER TABLE
`ALTER TABLE`--performs different functions when combined with different keywords

`RENAME TO`--rename table
```sql
ALTER TABLE old_table_name
RENAME TO new_table_name;
```

`RENAME COLUMN`--rename column
```sql
ALTER TABLE table_name
RENAME COLUMN old_column_name TO new_column_name;
```

`ADD`--add column
```sql
ALTER TABLE table_name
ADD new_column_name data_type constraint;
```

`DROP`--delete column
```sql
ALTER TABLE table_name
DROP column_name;
```

- *Note that keywords vary by RDBMS.  SQLite does not have an SQL statements to directly change the column data type, constraints, or default values, but other RDBMS do.*

---

**EXAMPLES**

**Rename Table**

In [32]:
%%sql

ALTER TABLE color
RENAME TO table_color;

 * sqlite:///databases/db_ex.db
(sqlite3.OperationalError) error in view view_color: no such column: wavelength
[SQL: ALTER TABLE color
RENAME TO table_color;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [33]:
%%sql

SELECT *
FROM table_color;

 * sqlite:///databases/db_ex.db
(sqlite3.OperationalError) no such table: table_color
[SQL: SELECT *
FROM table_color;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

**Rename Column**

In [34]:
%%sql

ALTER TABLE table_color
RENAME COLUMN name TO column_name;

 * sqlite:///databases/db_ex.db
(sqlite3.OperationalError) no such table: table_color
[SQL: ALTER TABLE table_color
RENAME COLUMN name TO column_name;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [35]:
%%sql

SELECT *
FROM table_color;

 * sqlite:///databases/db_ex.db
(sqlite3.OperationalError) no such table: table_color
[SQL: SELECT *
FROM table_color;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

**Add Column**

In [36]:
%%sql

ALTER TABLE table_color
ADD wavelength INTEGER;

 * sqlite:///databases/db_ex.db
(sqlite3.OperationalError) no such table: table_color
[SQL: ALTER TABLE table_color
ADD wavelength INTEGER;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [37]:
%%sql

SELECT *
FROM table_color;

 * sqlite:///databases/db_ex.db
(sqlite3.OperationalError) no such table: table_color
[SQL: SELECT *
FROM table_color;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

**Drop Column**

In [38]:
%%sql

ALTER TABLE table_color
DROP wavelength;

 * sqlite:///databases/db_ex.db
(sqlite3.OperationalError) no such table: table_color
[SQL: ALTER TABLE table_color
DROP wavelength;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [39]:
%%sql

SELECT *
FROM table_color;

 * sqlite:///databases/db_ex.db
(sqlite3.OperationalError) no such table: table_color
[SQL: SELECT *
FROM table_color;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

---

### Constraints
Constraints are used to further specify database schema.  They are used in conjunction with `CREATE TABLE` or `ALTER TABLE`.  We state constraints that any new or updated row must meet to be included in table.


```sql
CREATE TABLE table_name (
    column_name_a data_type constraint,
    column_name_b data_type constraint
);
```

Constraint | Use
--- | ---
`NOT NULL` | Column can NOT have NULL values
`UNIQUE` | Ensures all values in column are unique.  Whether or not NULL values are treated as unique varies by RDBMS.
`PRIMARY KEY` | A combination of NOT NULL and UNIQUE.  This ensures the column can be used as a primary key.
`FOREIGN KEY` | Maintains "referential integrity".  Prevents records from being inserted into the table with the foreign key, if the record's value in the foreign key column does not have a match in the primary key column of the foreign table.
`CHECK` | Ensures that the values in a column satisfy a specific condition
`DEFAULT` | Sets a default value for a column if no value is specified. String fields sometime use empty strings, `""`, as the default.  Numeric fields sometime use 0 or 1 as the default value.  If no default value is specified, then the default default value is `NULL`. 
`CREATE INDEX` | Used to create and retrieve data from a database very quickly
`AUTOINCREMENT` | When a new record is added into the table, its value in the auto-incremented column will be one more than the last integer used.  Sometimes used by RDBMS to create a primary key field (not SQLite or PostgreSQL though).

- *Note that constraints vary by RDBMS and will not always be placed after the data type*
- *Note that, in many RDBMS (not SQLite), to set a FOREIGN KEY constraint, the related table (the table with primary key field we are referencing) must already exist.  Otherwise we'll get an error.  For this reason, when we initially create database tables using SQL, we'll want create tables by starting at the outside of the schema and move inwards.  This is because the tables on the outside tend to only have primary keys.  The tables on the inside are the ones with primary and foreign keys.  Alternatively, we can create the tables in any order we choose if we do NOT set foreign key constraints initially.  After all tables have been created, we can add foreign key constraints with `ALTER TABLE`.*
- *Note that, in many RDBMS (not SQLite), when dropping tables, we need to drop tables starting at the inside of the schema and move outwards.  Once again, this has to do with referential integrity.*

---

**EXAMPLES**

- We'll create the following two tables again .  This time we'll specify the primary and foreign keys fields with constraints.  We will also add a column for color wavelength like we did above.

![](images/naming_conventions.png)

**Drop Tables**

In [40]:
%%sql

DROP TABLE IF EXISTS color;
DROP TABLE IF EXISTS table_color;
DROP TABLE IF EXISTS fruit;

 * sqlite:///databases/db_ex.db

[]

**Create Tables with Constraints**

In [41]:
%%sql

CREATE TABLE color (
    id INTEGER PRIMARY KEY,
    name varchar(20),
    wavelength INTEGER
);

 * sqlite:///databases/db_ex.db

[]

In [42]:
%%sql

SELECT *
FROM color;

 * sqlite:///databases/db_ex.db

[]

In [43]:
%%sql

CREATE TABLE fruit (
    id INTEGER PRIMARY KEY,
    name varchar(20),
    color_id INTEGER,
    FOREIGN KEY (color_id) REFERENCES color(id)
);

 * sqlite:///databases/db_ex.db

[]

In [44]:
%%sql

SELECT *
FROM fruit;

 * sqlite:///databases/db_ex.db

[]

---

## DML Keywords

- Used to add, update and delete **records**
- This contrasts DDL keywords that were used to add, update, and delete databases, tables, and **columns**

---

### INSERT INTO
`INSERT INTO`--insert new row. First specify which columns get new cell values and then specify cell values.  Column names are mapped to column values based on position within tuples.  Typically we do not specify the the primary key field nor a value for the primary key field as this is taken care of by the RDBMS automatically.

```sql
INSERT INTO table_name (column_name_a, column_name_b)
VALUES ('New value for column_name_a', 'New value for column_name_b.');
```

We can insert multiple rows of values in one SQL statement
```sql
INSERT INTO table_name (column_name_a, column_name_b)
VALUES 
    ('New value for column_name_a', 'New value for column_name_b.'),
    ('New value for column_name_a', 'New value for column_name_b.'),
    ('New value for column_name_a', 'New value for column_name_b.');
```

---

**EXAMPLES**

**`INSERT INTO`**

In [45]:
%%sql

INSERT INTO color (name, wavelength)
VALUES 
    ('Red', 700),
    ('Orange', 600),
    ("Yellow", 575),
    ('Green', 550),
    ('Blue', 475),
    ('Purple', 400),
    ('Ultra-violet', NULL);

 * sqlite:///databases/db_ex.db

[]

In [46]:
%%sql

SELECT *
FROM color;

 * sqlite:///databases/db_ex.db

[(1, 'Red', 700),
 (2, 'Orange', 600),
 (3, 'Yellow', 575),
 (4, 'Green', 550),
 (5, 'Blue', 475),
 (6, 'Purple', 400),
 (7, 'Ultra-violet', None)]

---

### INSERT INTO SELECT

`INSERT INTO SELECT`--select records from existing table and insert those records into another existing table.  Requires field data types to match.

```sql
INSERT INTO table_name_a (column_name_a, column_name_b)
SELECT column_name_1, column_name_2
FROM table_name_1
WHERE condition;
```

---

**EXAMPLES**

In [47]:
%%sql

INSERT INTO fruit (name)
SELECT name
FROM color
WHERE wavelength > 500;

 * sqlite:///databases/db_ex.db

[]

In [48]:
%%sql

SELECT *
FROM fruit;

 * sqlite:///databases/db_ex.db

[(1, 'Red', None),
 (2, 'Orange', None),
 (3, 'Yellow', None),
 (4, 'Green', None)]

---

### UPDATE
`UPDATE`--modify records' cell values in specified column(s).  Use a `WHERE` clause so that only records that meet a condition are modified.  If `WHERE` not used, all records will be modified!!!

```sql
UPDATE table_name
SET 
  column_name_a = 'New value for column_name_a', 
  column_name_b = 'New value for column_name_b.'
WHERE condition;
```

It is also common to update columns with an expression
```sql
UPDATE table_name
SET column_name = column_name * value;
```

---

**EXAMPLES**

The SQL statement below could be read, "For each record in the color table, if the record's cell value in the name column equals 'Ultra-violet', then set the record's cell value in the wavelength column equal to 100."

In [49]:
%%sql

UPDATE color
SET wavelength = 100
WHERE name = 'Ultra-violet';

 * sqlite:///databases/db_ex.db

[]

In [50]:
%%sql

SELECT *
FROM color;

 * sqlite:///databases/db_ex.db

[(1, 'Red', 700),
 (2, 'Orange', 600),
 (3, 'Yellow', 575),
 (4, 'Green', 550),
 (5, 'Blue', 475),
 (6, 'Purple', 400),
 (7, 'Ultra-violet', 100)]

---

### DELETE
`DELETE`--delete records.  Use a `WHERE` clause so that only records that meet a condition are deleted. If `WHERE` not used, all records will be deleted!!!

```sql
DELETE
FROM table_name
WHERE condition;
```

---

**EXAMPLES**

The SQL statement below could be read , "For each record in the color table, if the record's cell value in the name column equals 'Ultra-violet', then delete the record.

In [51]:
%%sql

DELETE
FROM color
WHERE name = 'Ultra-violet';

 * sqlite:///databases/db_ex.db

[]

In [52]:
%%sql

SELECT *
FROM color;

 * sqlite:///databases/db_ex.db

[(1, 'Red', 700),
 (2, 'Orange', 600),
 (3, 'Yellow', 575),
 (4, 'Green', 550),
 (5, 'Blue', 475),
 (6, 'Purple', 400)]

**Delete All Records**

In [53]:
%%sql

SELECT *
FROM fruit;

 * sqlite:///databases/db_ex.db

[(1, 'Red', None),
 (2, 'Orange', None),
 (3, 'Yellow', None),
 (4, 'Green', None)]

In [54]:
%%sql

DELETE
FROM fruit;

 * sqlite:///databases/db_ex.db

[]

In [55]:
%%sql

SELECT *
FROM fruit;

 * sqlite:///databases/db_ex.db

[]

---

## DQL Keywords

---

### SELECT
`SELECT`--return records in result table.  Although primarily used to select records, we can also use `SELECT` to print out strings, the result of mathematical expressions, etc.

`SELECT *`--pronounced "select star" or "select splat".  Include all columns in the result table.
```sql
SELECT * 
FROM table_name;
```

Optionally, specify which columns to include.  The order we write the columns will determine column order in the result table.
```sql
SELECT column_name_b, column_name_a
FROM table_name;
```

Optionally, use columns in expression
```sql
SELECT (column_name_b - column_name_a) / 2
FROM table_name;
```

---

**EXAMPLES**

**`SELECT`**

In [56]:
%%sql

SELECT 'Hello world';

 * sqlite:///databases/db_ex.db

[('Hello world',)]

In [57]:
%%sql

SELECT 1 + 2;

 * sqlite:///databases/db_ex.db

[(3,)]

In [58]:
%%sql

SELECT 'Hello world', 1 + 2

 * sqlite:///databases/db_ex.db

[('Hello world', 3)]

**`SELECT *`**

In [59]:
%%sql

SELECT *
FROM color;

 * sqlite:///databases/db_ex.db

[(1, 'Red', 700),
 (2, 'Orange', 600),
 (3, 'Yellow', 575),
 (4, 'Green', 550),
 (5, 'Blue', 475),
 (6, 'Purple', 400)]

**`SELECT` with Columns**

In [60]:
%%sql

SELECT wavelength, name
FROM color;

 * sqlite:///databases/db_ex.db

[(700, 'Red'),
 (600, 'Orange'),
 (575, 'Yellow'),
 (550, 'Green'),
 (475, 'Blue'),
 (400, 'Purple')]

**`SELECT` with Expressions**

In [61]:
%%sql

SELECT wavelength / 100
FROM color;

 * sqlite:///databases/db_ex.db

[(7,), (6,), (5,), (5,), (4,), (4,)]

---

### SELECT DISTINCT

`SELECT DISINCT`--optionally, filter out any record whose combination of cell values in the specified column(s) is a duplicate of another record already included in the result table.  I.e. select distinct records.  While most vertical replication is removed through normalization, when we JOIN tables, the result set will once again have vertical replication.  Selecting distinct records can be helpful here.

```sql
SELECT DISTINCT column_name_b, column_name_a
FROM table_name;
```

---

**EXAMPLES**

**Prepare Example Data**

In [62]:
%%sql

INSERT INTO color (name, wavelength)
VALUES ('Red', 675);

 * sqlite:///databases/db_ex.db

[]

In [63]:
%%sql

SELECT *
FROM color;

 * sqlite:///databases/db_ex.db

[(1, 'Red', 700),
 (2, 'Orange', 600),
 (3, 'Yellow', 575),
 (4, 'Green', 550),
 (5, 'Blue', 475),
 (6, 'Purple', 400),
 (7, 'Red', 675)]

The result table below excludes a record with another 'Red' value in the `name` column

In [64]:
%%sql

SELECT DISTINCT name
FROM color;

 * sqlite:///databases/db_ex.db

[('Red',), ('Orange',), ('Yellow',), ('Green',), ('Blue',), ('Purple',)]

The result table below does not exclude any records.  The added record is still distinct if we consider both the `name` column and the `wavelength` column.

In [65]:
%%sql

SELECT DISTINCT wavelength, name
FROM color;

 * sqlite:///databases/db_ex.db

[(700, 'Red'),
 (600, 'Orange'),
 (575, 'Yellow'),
 (550, 'Green'),
 (475, 'Blue'),
 (400, 'Purple'),
 (675, 'Red')]

**Delete Record**

In [66]:
%%sql

DELETE
FROM color
WHERE wavelength = 675

 * sqlite:///databases/db_ex.db

[]

---

### WHERE
`WHERE`--filter records.  Only records whose condition (Boolean expression) evaluates to true are kept.  `WHERE` can be added to SQL statements that use `SELECT`, `UPDATE`, `DELETE`, and more.

```sql
SELECT *
FROM table_name
WHERE condition;
```

---

**EXAMPLES**

`WHERE` can be read like "if".  The following SQL statement can be read,  "For each record in the `color` table, if the record's cell value in the `wavelength` column is greater than 500, then pass that record to `SELECT`.  Select all columns. Return result set."

In [67]:
%%sql

SELECT *
FROM color
WHERE wavelength > 500;

 * sqlite:///databases/db_ex.db

[(1, 'Red', 700), (2, 'Orange', 600), (3, 'Yellow', 575), (4, 'Green', 550)]

---

### ORDER BY
`ORDER BY`--sort records.  By default, ascending order (A or lowest number first).  The following two SQL statements are equivalent.
```sql
SELECT *
FROM table_name
ORDER BY column_name;
```

```sql
SELECT *
FROM table_name
ORDER BY column_name ASC;
```

`DESC`--optionally, descending order
```sql
SELECT *
FROM table_name
ORDER BY column_name DESC;
```
 
We can order by two or more columns.  If multiple records have the same cell value in the first column specified, the records' cell values in the second column will then be considered.
```sql
SELECT *
FROM table_name
ORDER BY column_name_a ASC, column_name_b DESC;
```

---

**EXAMPLES**

In [68]:
%%sql

SELECT *
FROM color
ORDER BY name;

 * sqlite:///databases/db_ex.db

[(5, 'Blue', 475),
 (4, 'Green', 550),
 (2, 'Orange', 600),
 (6, 'Purple', 400),
 (1, 'Red', 700),
 (3, 'Yellow', 575)]

---

### LIMIT

`LIMIT`--limit the number of records returned in result set
```sql
SELECT *
FROM table_name
LIMIT #;
```

`LIMIT # OFFSET #`--specify how many records we skip before starting to return records in result set.  An offset of 0 is the same as having no offset.  An offset of 1 skips the first record that would otherwise have been included.  An offset of 2 skips the first 2 records...etc.  We can also think about the offset in terms of record index position in the result table.  The first record starts index position 0 (not 1).  An offset of 0 returns record at index 0 and all records after.  An offset of 1 returns the record at index 1 and all records after...etc.
```sql
SELECT *
FROM table_name
LIMIT # OFFSET #;
```

---

**EXAMPLES**

In [69]:
%%sql

SELECT *
FROM color
LIMIT 1;

 * sqlite:///databases/db_ex.db

[(1, 'Red', 700)]

In [70]:
%%sql

SELECT *
FROM color
LIMIT 6 OFFSET 2;

 * sqlite:///databases/db_ex.db

[(3, 'Yellow', 575), (4, 'Green', 550), (5, 'Blue', 475), (6, 'Purple', 400)]

---

### Aggregate Functions

Aggregate functions input multiple values, but only return a single ("scalar") value each time they are run.  `COUNT()`, `SUM()`, `AVG()`, `MIN()`, and `MAX()` are the most common aggregate functions. `GROUP BY` and `HAVING` are used with aggregate functions.

---

#### COUNT()

`COUNT(*)`--aggregate function used with `SELECT`.  Counts records in table. As long as a record has a non-null value in at least one column that record will be counted.
```sql
SELECT COUNT(*)
FROM table_name;
```

`COUNT(column_name)`--same as `COUNT(*)`, but looks in single column.  As long as a record has non-null value in that single column it will be counted.
```sql
SELECT COUNT(column_name)
FROM table_name;
```

---

**EXAMPLES**

**`COUNT(*)`**

In [71]:
%%sql

SELECT COUNT(*)
FROM color;

 * sqlite:///databases/db_ex.db

[(6,)]

**`COUNT(column_name)`**

In [72]:
%%sql

SELECT COUNT(name)
FROM color;

 * sqlite:///databases/db_ex.db

[(6,)]

---

#### SUM()
`SUM()`--aggregate function used with `SELECT`.  Result table shows the sum of the specified numeric column.
```sql
SELECT SUM(column_name)
FROM table_name;
```

---

**EXAMPLES**

In [73]:
%%sql

SELECT SUM(wavelength)
FROM color;

 * sqlite:///databases/db_ex.db

[(3300,)]

---

#### AVG()
`AVG()`--aggregate function used with `SELECT`.  Result table shows the average of the specified numeric column.
```sql
SELECT AVG(column_name)
FROM table_name;
```

---

**EXAMPLES**

In [74]:
%%sql

SELECT AVG(wavelength)
FROM color;

 * sqlite:///databases/db_ex.db

[(550.0,)]

---

#### MIN() and MAX()
`MIN()` and `MAX()`--aggregate functions used with `SELECT`.  Only include the record whose cell value in the specified column is the lowest or highest.

```sql
SELECT MIN(column_name)
FROM table_name;
```

---

**EXAMPLES**

In [75]:
%%sql

SELECT name, MIN(wavelength)
FROM color;

 * sqlite:///databases/db_ex.db

[('Purple', 400)]

In [76]:
%%sql

SELECT name, MAX(wavelength)
FROM color;

 * sqlite:///databases/db_ex.db

[('Red', 700)]

---

### GROUP BY
`GROUP BY`--group records that share cell values in a specified column. Can group by multiple columns similar to `ORDER BY`.   Often used with the aggregate functions.  Groups made first, then aggregating function run once for each group.  If multiple groups, returns multiple values.

```sql
SELECT column_name, AG_FUN(column_name)
FROM table_name
GROUP BY column_name;
```
Note that we use `SELECT column_name` above to include group names in the result table.  This was not applicable when aggregate functions were run on the entire table (no group names to show).  It is also important that we do not try to select a column we are not grouped by.  This would try to include values for individual records, which is misleading when we have records grouped.

---

**EXAMPLES**

**Prepare example data**

In [77]:
%%sql

INSERT INTO fruit (name, color_id)
VALUES 
    ('Strawberry', 1),
    ('Strawberry', 1),
    ('Strawberry', 1),
    ('Cherry', 1),
    ('Cherry', 1);

SELECT *
FROM fruit;

 * sqlite:///databases/db_ex.db

[(1, 'Strawberry', 1),
 (2, 'Strawberry', 1),
 (3, 'Strawberry', 1),
 (4, 'Cherry', 1),
 (5, 'Cherry', 1)]

**`GROUP BY` Correct Use**

In [78]:
%%sql

SELECT name, count(name)
FROM fruit
GROUP BY name;

 * sqlite:///databases/db_ex.db

[('Cherry', 2), ('Strawberry', 3)]

**`GROUP BY` Incorrect Use**

We group and apply an aggregate function to each group. However, we also try `SELECT id`.  This tries to display the id of all the records in the result table even though we have grouped the records.  Even though  this is impossible, it still tries.  It displays the id of the first record included in the "Strawberry" group and the id of the first record included in the "Cherry" group. This is misleading.

In [79]:
%%sql

SELECT id, name, count(name)
FROM fruit
GROUP BY name;

 * sqlite:///databases/db_ex.db

[(4, 'Cherry', 2), (1, 'Strawberry', 3)]

---

### HAVING
`HAVING`--same as `WHERE`, but used only with aggregate functions.  `HAVING` was was added to SQL because the `WHERE` keyword could not be used with aggregate functions.  `HAVING` is run after `GROUP BY`.

```sql
SELECT *
FROM table_name
GROUP BY column_name
HAVING AG_FUN(column_name) condition;
```

---

**EXAMPLES**

In [80]:
%%sql

SELECT name, COUNT(name)
FROM fruit
GROUP BY name
HAVING COUNT(name) >= 3;

 * sqlite:///databases/db_ex.db

[('Strawberry', 3)]

---

### Order of Execution

Clauses are generally run in this order:

![](images/order_of_execution.png)

---

**EXAMPLES**

In [81]:
%%sql

SELECT *
FROM fruit

 * sqlite:///databases/db_ex.db

[(1, 'Strawberry', 1),
 (2, 'Strawberry', 1),
 (3, 'Strawberry', 1),
 (4, 'Cherry', 1),
 (5, 'Cherry', 1)]

In the below SQL statement we:

1. Filter records.  Filter out records with id of 1 or 2, leaving records with id of 3, 4, and 5.
1. Group records.  Strawberry group and cherry group.
1. Filter groups.  Count records.  Strawberry group has one record. Cherry group has two records.  Remove strawberry group, leaving cherry.
1. Groups passed onto select.  Select the name of the group and the count of records for the remaining group.  Return result set.

In [82]:
%%sql

SELECT name, count(name)
FROM fruit
WHERE id  >= 3
GROUP BY name
HAVING COUNT(name) >= 2;

 * sqlite:///databases/db_ex.db

[('Cherry', 2)]

---

### Other Helpful Functions

---

#### LENGTH()

`LENGTH()`--return the length of a cell value.  Counts number of characters in a cell.  `LENGTH()` is different from `COUNT()`, which counts the number of records in a table.  For this reason length is NOT considered an aggregating function.  However, length is similar in that it always return a scalar value.

```sql
SELECT LENGTH(column_name)
FROM table_name
```

Because `LENGTH()` evaluates to a single value, we can use it within other functions
```sql
SELECT *
FROM table_name
WHERE AG_FUN(LENGTH(column_name)) condition
```

*Note that in some RDBMS the function is `LEN()`*

---

**EXAMPLES**

**`LENGTH()`**

In [83]:
%%sql

SELECT LENGTH(name)
FROM color

 * sqlite:///databases/db_ex.db

[(3,), (6,), (6,), (5,), (4,), (6,)]

**Nested Functions**

In [84]:
%%sql

SELECT AVG(LENGTH(name))
FROM color

 * sqlite:///databases/db_ex.db

[(5.0,)]

---

#### CONCAT()

- Concatenation combines two or more strings into one
- Some RDBMS use a concatenation function, like `CONCAT()`
- Others use the `+` operator.  When used with numerical data performs arithmetic.  When used with string data performs concatenation.


SQLite use the `||` operator:
```sqlite
'String 1' || 'String 2'
```

---

**EXAMPLES**

In [85]:
%%sql
SELECT 'Hello' || ' world';

 * sqlite:///databases/db_ex.db

[('Hello world',)]

---

#### UPPER() and LOWER()

`UPPER()` and `LOWER()`--convert all text characters in a cell to the specified case.  Especially useful for applying conditions to input data that inconsistently uses capitalization. 

```sql
SELECT *
FROM table_name
WHERE UPPER(column_name) condition
```

---

**EXAMPLES**

In [86]:
%%sql

SELECT *
FROM color
WHERE name = 'red'

 * sqlite:///databases/db_ex.db

[]

**`LOWER()`**

In [87]:
%%sql

SELECT *
FROM color
WHERE LOWER(name) = 'red'

 * sqlite:///databases/db_ex.db

[(1, 'Red', 700)]

---

## Operators

---

### Arithmetic Operators

Arithmetic operators are primarily used in conditional clauses and the `SELECT` clause

Operator | Use
--- | ---
`+` | Addition
`-` | Subtraction
`*` | Multiply
`/` | Division
`%` | Modulo

---

**EXAMPLES**

**Operator in Condition**

Note the difference in meaning between select star and multiplication

In [88]:
%%sql

SELECT *
FROM color
WHERE wavelength > (55 * 10)

 * sqlite:///databases/db_ex.db

[(1, 'Red', 700), (2, 'Orange', 600), (3, 'Yellow', 575)]

In [89]:
%%sql

SELECT *
FROM color
WHERE wavelength < (wavelength * 2)

 * sqlite:///databases/db_ex.db

[(1, 'Red', 700),
 (2, 'Orange', 600),
 (3, 'Yellow', 575),
 (4, 'Green', 550),
 (5, 'Blue', 475),
 (6, 'Purple', 400)]

**Operator in `SELECT`**

In [90]:
%%sql

SELECT name, wavelength, (wavelength * -1)
FROM color

 * sqlite:///databases/db_ex.db

[('Red', 700, -700),
 ('Orange', 600, -600),
 ('Yellow', 575, -575),
 ('Green', 550, -550),
 ('Blue', 475, -475),
 ('Purple', 400, -400)]

**Operator in `SELECT` without `FROM`**

Note that if two integers are used in division then floor division is used by default.  We can get the expected results by using at least one floating point number in the expression.

In [91]:
%%sql

SELECT 1+2, 3-4, 5*6, 7/8, 7.0/8, (7*1.0)/8

 * sqlite:///databases/db_ex.db

[(3, -1, 30, 0, 0.875, 0.875)]

---

### Bitwise Operators

Work on individual bits of information. They compare two input bits and return one output bit.  Usually one byte of information is compared at a time as computers think in bytes.

Operator | Description | Example
--- | --- | ---
`&` | Bitwise AND | 1&1=1, 1&0=0, 0&0=0
`\` | Bitwise OR | 1\|1=1, 1\|0=1, 0\|0=0
`^` | Bitwise exclusive OR | 1^1=0, 1^0=1, 0^0=0

---

### Compound Operators

Operator | Description
--- | ---
`+=` | Add equals
`-=` | Subtract equals
`*=` | Multiply equals
`/=` | Divide equals
`%=` | Modulo equals
`&=` | Bitwise AND equals
`\|*=` | Bitwise OR equals
`^-=` | Bitwise exclusive OR equals

---

### Comparison Operators

- Expressions with comparison operators evaluate to a Boolean value
- Boolean values are commonly used in conditional statements to control the flow of code
- In SQL, conditional statements often involve the `WHERE`, `HAVING`, and `CASE WHEN` keywords
- Note that in SQL, `=` is occasionally used to assign values to identifies, as seen in the `UPDATE` statement, but mostly `=` is used as a comparison operator.


Operator | Use
--- | ---
`=` | TRUE if equal
`<` | TRUE if less-than
`>` | TRUE if greater-than
`<=` | TRUE if less-than or equal
`>=` | TRUE if greater than or equal
`<>` or `!=` | TRUE if not equal

---

**EXAMPLES**

**`=`**

In [92]:
%%sql

SELECT *
FROM color
WHERE wavelength = 550;

 * sqlite:///databases/db_ex.db

[(4, 'Green', 550)]

**`<>` and `!=`**

In [93]:
%%sql

SELECT *
FROM color
WHERE wavelength <> 550;

 * sqlite:///databases/db_ex.db

[(1, 'Red', 700),
 (2, 'Orange', 600),
 (3, 'Yellow', 575),
 (5, 'Blue', 475),
 (6, 'Purple', 400)]

In [94]:
%%sql

SELECT *
FROM color
WHERE wavelength != 550;

 * sqlite:///databases/db_ex.db

[(1, 'Red', 700),
 (2, 'Orange', 600),
 (3, 'Yellow', 575),
 (5, 'Blue', 475),
 (6, 'Purple', 400)]

**`>`**

In [95]:
%%sql

SELECT *
FROM color
WHERE wavelength > 550;

 * sqlite:///databases/db_ex.db

[(1, 'Red', 700), (2, 'Orange', 600), (3, 'Yellow', 575)]

**`<`**

In [96]:
%%sql

SELECT *
FROM color
WHERE wavelength < 550;

 * sqlite:///databases/db_ex.db

[(5, 'Blue', 475), (6, 'Purple', 400)]

**`>=`**

In [97]:
%%sql

SELECT *
FROM color
WHERE wavelength >= 550;

 * sqlite:///databases/db_ex.db

[(1, 'Red', 700), (2, 'Orange', 600), (3, 'Yellow', 575), (4, 'Green', 550)]

**`<=`**

In [98]:
%%sql

SELECT *
FROM color
WHERE wavelength <= 550;

 * sqlite:///databases/db_ex.db

[(4, 'Green', 550), (5, 'Blue', 475), (6, 'Purple', 400)]

---

### Logical Operators

- Expression using logical operators evaluate to a Boolean value just like the comparison operators above
- **Operator precedence**--order of operations.  Similar to PEMDAS.  Any `NOT`s evaluated first, then any `AND`s, and then any `OR`s.  When multiple conditions it is best practice to enclose conditions and their keywords in parentheses for better readability.

Operator | Description
--- | ---
`ALL` | TRUE if all of the subquery values meet the condition
`AND` | TRUE if all the conditions separated by AND is TRUE.  A SELECT using AND can be visualized by Intersection in set theory.
`ANY` | TRUE if any of subquery values meet the condition
`BETWEEN` | TRUE if a value is within a range of specified values
`EXISTS` | TRUE if the subquery returns one or more records
`IN` | TRUE if the value is in a list of specified values
`IS NULL` | TRUE if NULL value
`LIKE` | TRUE if the value matches a pattern that uses wildcards
`NOT` | Displays a record if the conditions(s) is NOT TRUE
`OR` | TRUE if any of the conditions separated by OR is TRUE.  A SELECT using OR can be visualized by Union in set theory.
`SOME` |Same thing as ANY

---

#### ALL and ANY

`ALL` and `ANY`--allows us to compare a single value to a range of values.  A subquery first returns a result set (range of values).  The main statement then compares a single value (a record's cell value) to the range of values.

`ALL`--condition will only be true if the operation is true for all values in the range of values
```sql
SELECT *
FROM table_name
WHERE column_name comparison_operator ALL
(Subquery);
```

`ANY`--condition will be true if the operation is true for any values in the range of values
```sql
SELECT *
FROM table_name
WHERE column_name comparison_operator ALL
(Subquery);
```

*Note that SQLite does not implement ALL or ANY in this manner*

---

#### AND

```sql
SELECT *
FROM table_name
WHERE condition AND condition;
```

---

**EXAMPLES**

In [99]:
%%sql

SELECT *
FROM color
WHERE wavelength < 500 AND name = 'Red';

 * sqlite:///databases/db_ex.db

[]

---

#### ANY

```sql
SELECT *
FROM table_name
WHERE column_name comparison_operator ANY
(Subquery);
```

---

#### BETWEEN

```sql
SELECT *
FROM table_name
WHERE column_name BETWEEN value AND value;
```

*Note that whether the bounds are inclusive or exclusive may vary by RDBMS*

---

**EXAMPLES**

In [100]:
%%sql

SELECT *
FROM color
WHERE wavelength BETWEEN 550 AND 600;

 * sqlite:///databases/db_ex.db

[(2, 'Orange', 600), (3, 'Yellow', 575), (4, 'Green', 550)]

---

#### EXISTS

```sql
SELECT *
FROM table_name
WHERE EXISTS
(Subquery);
```

---

**EXAMPLES**

In [101]:
%%sql

SELECT *
FROM color
WHERE EXISTS 
(SELECT *
FROM color
WHERE name = 'Red');

 * sqlite:///databases/db_ex.db

[(1, 'Red', 700),
 (2, 'Orange', 600),
 (3, 'Yellow', 575),
 (4, 'Green', 550),
 (5, 'Blue', 475),
 (6, 'Purple', 400)]

In [102]:
%%sql

SELECT *
FROM color
WHERE EXISTS 
(SELECT *
FROM color
WHERE name = 'Light urple');

 * sqlite:///databases/db_ex.db

[]

---

#### IN

```sql
SELECT *
FROM table_name
WHERE column_name IN (value_a, value_b);
```

---

**EXAMPLES**

In [103]:
%%sql
SELECT *
FROM color
WHERE name IN ('Red', 'Orange');

 * sqlite:///databases/db_ex.db

[(1, 'Red', 700), (2, 'Orange', 600)]

`IN` is the equivalent of writing multiple comparisons of equality separated by `OR`

In [104]:
%%sql
SELECT *
FROM color
WHERE name = 'Red' OR name = 'Orange';

 * sqlite:///databases/db_ex.db

[(1, 'Red', 700), (2, 'Orange', 600)]

---

#### IS NULL

`NULL`--value that represents the absence of data

`IS NULL` and `IS NOT NULL`--check to see if a value is a null value before performing an action.  Commonly used in conditional statements because null values often lead to errors (or more null values) when used in statements.  

We use `IS` and `IS NOT` instead of `= NULL` and `!= NULL`.  Also, while `NOT IS NULL` could be used, `IS NOT NULL` is easier to read.

```sql
SELECT *
FROM table_name
WHERE column_name IS NULL;
```
*Note that there are many more "null functions" that use null values.  These vary widely between RDBMS.*

---

**EXAMPLES**

**`IS NULL`**

In [105]:
%%sql

SELECT *
FROM color
WHERE wavelength IS NULL;

 * sqlite:///databases/db_ex.db

[]

**`IS NOT NULL`**

In [106]:
%%sql

SELECT *
FROM color
WHERE wavelength IS NOT NULL;

 * sqlite:///databases/db_ex.db

[(1, 'Red', 700),
 (2, 'Orange', 600),
 (3, 'Yellow', 575),
 (4, 'Green', 550),
 (5, 'Blue', 475),
 (6, 'Purple', 400)]

---

####  LIKE

`LIKE`--perform "fuzzy" comparison of equality between a string and a pattern utilizing wildcard characters

`ILIKE`--same as like, but case insensitive

**Wildcard**--single character that stands for multiple other characters.  Concept also seen "regular expressions" and "globbing"  Regular expressions are more powerful and also commonly supported by RDBMS.

Symbol | Description | Example
--- | --- | ---
`_` | Represents any single characters | `h_t` finds hat, hot, and hit
`%` | Represents any sequence of zero or more characters | `bl%` finds blue and black.

```sql
SELECT *
FROM table_name
WHERE column_name LIKE 'pattern with the wildcards %, _, [#], etc.';
```

*Note that wildcard character meaning varies between RDBMS.*

---

**EXAMPLES**

**`%`**

In [107]:
%%sql

SELECT *
FROM color
WHERE name LIKE '%e';

 * sqlite:///databases/db_ex.db

[(2, 'Orange', 600), (5, 'Blue', 475), (6, 'Purple', 400)]

**`_`**

In [108]:
%%sql

SELECT *
FROM color
WHERE name LIKE '_urple';

 * sqlite:///databases/db_ex.db

[(6, 'Purple', 400)]

---

#### NOT

`NOT`--negates a condition
```sql
SELECT *
FROM table_name
WHERE NOT condition;
```

---

**EXAMPLES**

In [109]:
%%sql
SELECT *
FROM color
WHERE name NOT IN ('Red', 'Orange');

 * sqlite:///databases/db_ex.db

[(3, 'Yellow', 575), (4, 'Green', 550), (5, 'Blue', 475), (6, 'Purple', 400)]

The condition being negated is usually not a simple condition with a comparison operator as it is clearer to switch the comparison operator instead of use `NOT`

In [110]:
%%sql
SELECT *
FROM color
WHERE wavelength != 550;

 * sqlite:///databases/db_ex.db

[(1, 'Red', 700),
 (2, 'Orange', 600),
 (3, 'Yellow', 575),
 (5, 'Blue', 475),
 (6, 'Purple', 400)]

In [111]:
%%sql
SELECT *
FROM color
WHERE NOT wavelength = 550;

 * sqlite:///databases/db_ex.db

[(1, 'Red', 700),
 (2, 'Orange', 600),
 (3, 'Yellow', 575),
 (5, 'Blue', 475),
 (6, 'Purple', 400)]

---

#### OR

```sql
SELECT *
FROM table_name
WHERE condition OR condition;
```

---

**EXAMPLES**

In [112]:
%%sql

SELECT *
FROM color
WHERE wavelength < 500 OR name = 'Red';

 * sqlite:///databases/db_ex.db

[(1, 'Red', 700), (5, 'Blue', 475), (6, 'Purple', 400)]

---

## Advanced SQL

---

### Result Set Shape

- Understanding the "shape" of result sets is essential to reading more complex queries and SQL scripts
- The result set is always a table.  However this table may be:
    1. One row, one column.  I.e. a single cell value (**scalar value**).  This allows further use of result set.
    1. One row, multiple column.  I.e. a row.  Often row cells contain multiple data types.  This limits further use of the result set.
    1. Multiple rows, one column.  I.e. a column.  Column cells contain the same data type.  This allows further use of result set.
    1. Multiple rows, multiple columns.  I.e. a table.  Further queries can use as a derived table (see *Subqueries*).

---

**EXAMPLES**

**One Row One Column**

In [113]:
%%sql

SELECT wavelength
FROM color
WHERE id = 1

 * sqlite:///databases/db_ex.db

[(700,)]

**One Row Multiple Columns**

In [114]:
%%sql

SELECT *
FROM color
WHERE id = 1

 * sqlite:///databases/db_ex.db

[(1, 'Red', 700)]

**Multiple Rows One Column**

In [115]:
%%sql

SELECT wavelength
FROM color

 * sqlite:///databases/db_ex.db

[(700,), (600,), (575,), (550,), (475,), (400,)]

**Multiple Rows Multiple Columns**

In [116]:
%%sql

SELECT *
FROM color

 * sqlite:///databases/db_ex.db

[(1, 'Red', 700),
 (2, 'Orange', 600),
 (3, 'Yellow', 575),
 (4, 'Green', 550),
 (5, 'Blue', 475),
 (6, 'Purple', 400)]

---

### AS  Alias
`AS`--assign temporary identifier (AKA an alias).  These are typically table aliases or column aliases.

Column alias may make result table easier read
```sql
SELECT column_name AS alias_name
FROM table_name;
```

Table alias may shorten table name for use in dot notation during joins or correlated subqueries
```sql
SELECT t.column_name 
FROM table_name AS t;
```

`AS` may be optional in a RDBMS.  However, always using `AS` makes it clearer to the reader what is occurring.
```sql
SELECT column_name alias_name
FROM table_name;
```

---

**EXAMPLES**

**Column Alias**

In [117]:
%%sql

SELECT wavelength AS "Wavelength (nm)", name
FROM color;

 * sqlite:///databases/db_ex.db

[(700, 'Red'),
 (600, 'Orange'),
 (575, 'Yellow'),
 (550, 'Green'),
 (475, 'Blue'),
 (400, 'Purple')]

**Table Alias**

In [118]:
%%sql

SELECT c.wavelength, c.name
FROM color AS c;

 * sqlite:///databases/db_ex.db

[(700, 'Red'),
 (600, 'Orange'),
 (575, 'Yellow'),
 (550, 'Green'),
 (475, 'Blue'),
 (400, 'Purple')]

**`AS` Omitted**

In [119]:
%%sql

SELECT c.wavelength, c.name
FROM color c;

 * sqlite:///databases/db_ex.db

[(700, 'Red'),
 (600, 'Orange'),
 (575, 'Yellow'),
 (550, 'Green'),
 (475, 'Blue'),
 (400, 'Purple')]

---

### CASE WHEN THEN
`CASE`, `WHEN`, `THEN`, `ELSE` statement--analogous to Python if-elif-else compound statement...but run for each each record...and with terrible syntax
```sql
SELECT *,
CASE 
    WHEN condition_1 THEN result_1
    WHEN condition_2 THEN result_2
    ELSE result_3
END AS column_alias_for_result_table
FROM table_name;
```
- Like Python, the `ELSE` is optional
- Must include comma after `SELECT`

---

**EXAMPLES**

The following statement can be read, 

"For each record in the `colors` table:

If the record's cell value in the `wavelength` column is greater than 500, then, in the result table `hot_or_cold` column make that record's cell value `This is a hot color`.

Else, if the record's cell value in the `wavelength` column is less than or equal to 500, then, in the result table `hot_or_cold` column make that record's cell value `This is a cool color`."

**`CASE`, `WHEN`, `THEN`**

**Alias Used**

In [120]:
%%sql

SELECT *,
CASE 
    WHEN  wavelength > 550 THEN 'This is a hot color.'
    WHEN wavelength <=550 THEN 'This is a cool color.'
END AS hot_or_cold
FROM color;

 * sqlite:///databases/db_ex.db

[(1, 'Red', 700, 'This is a hot color.'),
 (2, 'Orange', 600, 'This is a hot color.'),
 (3, 'Yellow', 575, 'This is a hot color.'),
 (4, 'Green', 550, 'This is a cool color.'),
 (5, 'Blue', 475, 'This is a cool color.'),
 (6, 'Purple', 400, 'This is a cool color.')]

**Alias not used**

In [121]:
%%sql

SELECT *,
CASE 
    WHEN  wavelength > 550 THEN 'This is a hot color.'
    WHEN wavelength <=550 THEN 'This is a cool color.'
END
FROM color;

 * sqlite:///databases/db_ex.db

[(1, 'Red', 700, 'This is a hot color.'),
 (2, 'Orange', 600, 'This is a hot color.'),
 (3, 'Yellow', 575, 'This is a hot color.'),
 (4, 'Green', 550, 'This is a cool color.'),
 (5, 'Blue', 475, 'This is a cool color.'),
 (6, 'Purple', 400, 'This is a cool color.')]

---

### JOIN

- Database tables in second normal or third number form may only store a portion of the data a user wants to view in a result table
- Join statements can combine multiple tables and are commonly used along with `SELECT` and other DQL keywords
- SQL syntax for join statements are included in the *Relational Database* section

---

### UNION

`UNION`--combine the result tables from two or more select statements. If two result tables, would glue records from the second result table onto the bottom of the first.  Columns are matched based on their position after the `SELECT` keyword.  Because of this, every select statement within `UNION` must return the same number of columns in the same column order in the result set.  Though not always a requirement, matching columns should also contain the same data type.  

Note that union is different than a join.  A join statement inputs the original tables while union inputs result tables.  A join statement glues the left and right side of tables together (adds columns) while a union glues the top and bottom of tables together (adds rows).

`UNION ALL`--same as `UNION` but includes non-distinct records.  `UNION` only includes distinct records.

```sql
SELECT column_name_a, column_name_b FROM table_name_a
UNION ALL
SELECT column_name_1, column_name_2 FROM table_name_b;
```

---

**EXAMPLES**

In [122]:
%%sql

SELECT name FROM color;

 * sqlite:///databases/db_ex.db

[('Red',), ('Orange',), ('Yellow',), ('Green',), ('Blue',), ('Purple',)]

In [123]:
%%sql

SELECT name FROM fruit;

 * sqlite:///databases/db_ex.db

[('Strawberry',), ('Strawberry',), ('Strawberry',), ('Cherry',), ('Cherry',)]

**`UNION`**

In [124]:
%%sql

SELECT name FROM color
UNION
SELECT name FROM fruit;

 * sqlite:///databases/db_ex.db

[('Blue',),
 ('Cherry',),
 ('Green',),
 ('Orange',),
 ('Purple',),
 ('Red',),
 ('Strawberry',),
 ('Yellow',)]

**`UNION ALL`**

In [125]:
%%sql

SELECT name FROM color
UNION ALL
SELECT name FROM fruit;

 * sqlite:///databases/db_ex.db

[('Red',),
 ('Orange',),
 ('Yellow',),
 ('Green',),
 ('Blue',),
 ('Purple',),
 ('Strawberry',),
 ('Strawberry',),
 ('Strawberry',),
 ('Cherry',),
 ('Cherry',)]

---

### CREATE VIEW
`CREATE VIEW`--create virtual table (the "view") based on the result table from a query

Similar to ordinary result table, but also behaves more like ordinary tables:
 
1. View is permanently viewable
1. View updates as data changes
1. View can itself be queried (that's how we view the view)
1. View can be modified or dropped
    
```sql
CREATE VIEW view_name AS
SELECT *
FROM table_name;
```

`CREATE OR REPLACE VIEW`--update view.  Create a new view and reassign to the same identifier.

```sql
CREATE OR REPLACE VIEW view_name AS
SELECT *
FROM table_name;
```

`DROP VIEW`--delete view
```sql
DROP VIEW view_name
```

---

**EXAMPLES**

**`DROP VIEW`**

In [126]:
%%sql

DROP VIEW IF EXISTS view_color;

 * sqlite:///databases/db_ex.db

[]

**`CREATE VIEW`**

In [127]:
%%sql

CREATE VIEW view_color AS
SELECT name, wavelength
FROM color
WHERE wavelength > 500;

SELECT *
FROM view_color;

 * sqlite:///databases/db_ex.db

[('Red', 700), ('Orange', 600), ('Yellow', 575), ('Green', 550)]

The view changes as the data the view references changes

In [128]:
%%sql

UPDATE color
SET wavelength = 675
WHERE name = 'Red';

SELECT *
FROM view_color;

 * sqlite:///databases/db_ex.db

[('Red', 675), ('Orange', 600), ('Yellow', 575), ('Green', 550)]

---

### Subquery

- **Subquery**--query nested within another SQL statement
    1. Enclosed in `()`.  Subquery does NOT end in a semi-colon.
    1. Often found within `SELECT`, `INSERT`, `UPDATE` or `DELETE` statements.  Which clause they are placed in depends on the shape of the result set.  When placed within the `FROM` clause, the returned result table is called a **Derived Table**.
    1. Subqueries must be able to run on their own.  It is common to write the subquery as an independent query first, verify the result is as expected, and then include it as a subquery.
    
```sql
SELECT *
FROM (subquery);
```

- *Subqueries are useful, but subqueries can make code hard to read and are slower to run.  Where possible, it is recommended to avoid subqueries and use JOINs or common table expressions.*

---

**EXAMPLES**

**Simple Subquery**

In [129]:
%%sql

SELECT (SELECT 'Hello world');

 * sqlite:///databases/db_ex.db

[('Hello world',)]

**Subquery used as Derived Table**

We'll first view what the subquery result set would be by itself, and then use it nested within an outer query

In [130]:
%%sql

SELECT *
FROM color
WHERE wavelength > 500

 * sqlite:///databases/db_ex.db

[(1, 'Red', 675), (2, 'Orange', 600), (3, 'Yellow', 575), (4, 'Green', 550)]

In [131]:
%%sql

SELECT *
FROM (
    SELECT *
    FROM color
    WHERE wavelength > 500
)
WHERE wavelength < 600;

 * sqlite:///databases/db_ex.db

[(3, 'Yellow', 575), (4, 'Green', 550)]

**Subquery used in Condition**

We'll first view what the subquery result set would be by itself, and then use it nested within an outer query

In [132]:
%%sql

SELECT AVG(LENGTH(name)) 
FROM color;

 * sqlite:///databases/db_ex.db

[(5.0,)]

In [133]:
%%sql

SELECT name
FROM color
WHERE LENGTH(name) > (
    SELECT AVG(LENGTH(name)) 
    FROM color
);

 * sqlite:///databases/db_ex.db

[('Orange',), ('Yellow',), ('Purple',)]

---

### Common Table Expression

- **Common Table Expression (CTE)**--temporary named result set that we can reference within `SELECT`, `INSERT`, `UPDATE`, or `DELETE` statements. It is temporary because the CTE result set only exists for a single query.  It is named because we give it a variable name.

```sql
WITH CTE_result_set_name AS (
    query
)
SELECT *
FROM CTE_result_set_name
```

- Note that there is NOT a semicolon at the end of the CTE SQL statement
- CTEs and subqueries are very similar.  However, there are differences between CTE and subqueries.

Quality | Subquery | CTE
--- | --- | ---
Easier to read? | No | Yes
Potentially faster? | No | Yes
Potentially recursive? | No | Yes
Code typed once and reusable many times within query? | No | Yes
Can act like single column | Yes | No
Can be used directly in a `WHERE` clause? | Yes | No

- As we see here, CTE are generally better, but have limitations. Unlike subqueries CTEs are never treated as a scalar value or a single column.  They are always treated like a full table. This prevents them from being used directly in a `WHERE` clause.  CTE are commonly used in place of derived tables.

---

**EXAMPLES**

**Simple CTE**

In [134]:
%%sql

WITH celestial_salutation AS ( 
    SELECT 'Hello world' 
)
SELECT * 
FROM celestial_salutation;

 * sqlite:///databases/db_ex.db

[('Hello world',)]

**CTE as Derived Table**

We'll first view what the CTE result set would be by itself, and then use it within the query

In [135]:
%%sql

SELECT *
FROM color
WHERE wavelength > 500

 * sqlite:///databases/db_ex.db

[(1, 'Red', 675), (2, 'Orange', 600), (3, 'Yellow', 575), (4, 'Green', 550)]

In [136]:
%%sql

WITH CTE_result_set_name AS(
    SELECT *
    FROM color
    WHERE wavelength > 500
)
SELECT *
FROM CTE_result_set_name
WHERE wavelength < 600;

 * sqlite:///databases/db_ex.db

[(3, 'Yellow', 575), (4, 'Green', 550)]

---

### Indexes

- **Blocks**--each database table is stored in computer non-volatile memory.  The rows in the table are split into a bunch of groups and each group of rows is stored in a "block" of computer memory.  A block is a pre-allocated bucket/bin/chunk of computer memory typically about 8 KiB in size.

![](images/blocks.png)

- **Sequential/Full Table Scan**--CRUD database by going through all the rows in the table.  Sequential scans require the computer to go to a block, go through all rows in the block, and repeat for each block comprising the table.  This is Linear Time, O(n), and is relatively slow.
    - E.g. `SELECT * FROM table_name WHERE name LIKE '%Subject'`
- **Database Index**--internal data structure that stores the location in the computer memory (block and row location) of desired values.  
- Enables us avoid full table scans and quickly retrieve desired values.  With indexes, an operation may go from Linear Time to Logarithmic Time or even Constant Time!  This will depend on the index data structure, field type, and whether we are doing C, R, U, or D.
    - E.g. create index for `id` column. Maps each row's `id` value to the row's computer memory location.  Use row `id` in a condition to quickly retrieve row.  `SELECT * FROM table_name WHERE id = 10`.
- Database indexes are similar to indexes in a book:
    1. Book: important words are mapped to page numbers
    1. Database index: important rows or values are mapped to computer memory locations
- Indexes have a couple trade offs:
    1. Indexes require writes and a relatively small amount of storage space to maintain the index data structure
    1. When new rows are inserted or existing rows are updated, the index data structure must be updated.  This actually slows down the CU operation.
-  For this reason indexes:
    1. Increase performance for repeated reads (queries)
    1. Decrease performance for repeated writes (inserts and updates)
- Indexes are created:
    1. Implicitly.   RDBMS create indexes for us when constraints like `PRIMARY KEY` and`UNIQUE` are defined.  RDBMS use indexes to enforce these constraints.
    1. Explicitly.  Indexes can be created explicitly with RDBMS commands.

`CREATE INDEX`--explicitly create index.  Duplicate cell values in column allowed.  Uses RDBMS default index data structure.
```sql
CREATE INDEX index_name
ON table_name (column_name)
```

`CREATE INDEX UNIQUE`--same as `CREATE INDEX`, but duplicate cell values in column not allowed.  Note that in most RDBMS, explicitly creating unique indexes is not necessary. This is because any column with a unique constraint implicitly has a unique index built for it already.  We would just be duplicating this.
```sql
CREATE INDEX UNIQUE index_name
ON table_name (column_name)
```

**Expression Index**--"an index column need not be just a column of the underlying table, but can be a function or scalar expression computed from one or more columns of the table. This feature is useful to obtain fast access to tables based on the results of computations."
```sql
CREATE INDEX index_name
ON table_name (FUNCTION(column_name))
```

`DROP INDEX`--delete index
```sql
DROP INDEX index_name
```
- *Note that syntax for indexes varies by RDBMS as index creation is not part of the SQL standard*

---

#### Forward Indexes

- There are many types of index data structures.  They can be grouped into "forward" or "inverse" indexes.
- **Forward Index**--normal index.  Specify column.  Index data structure maps column values to computer memory location.  Retrieve rows fast using column values.
     1. **B-Trees**--self balancing tree data structure.  Most common index data structure and often the default index data structure.  Used for conditions with comparison operators (`>`, `<`, `>=`, `<=`, and `=`).  Used with `BETWEEN`, `IN`, `IS NULL`, and `NOT NULL` operators.  Used for `LIKE 'characters%'` (but not `LIKE '%characters'` with the `%` prefixing).  Sometimes used to retrieve data in sorted order.
         - E.g. `SELECT * FROM table_name WHERE name LIKE 'Subject%'`
     1. **Hashes**--specify column.  Each cell value is passed through a hash function before it's mapped to computer memory location.  Retrieve row quickly only when  `=` operator used in a condition.
         - E.g. `SELECT * FROM table_name WHERE id = 10`
     1. **BRIN**--block range index.  Similar to B-tree index, but requires less storage space and runs faster.  However, only faster if the data is mostly sorted.  Newer and not commonly used yet.

---

#### Inverse Indexes

- **Inverse Index**--index used for word (or other item) searches.  Specify column (typically TEXT column).  Each row typically contains a text document. For each row, split up the document (often splits at ' ') into array (list) of words.  Maps each word in array to that document.  Later perform text search on column.  Quickly retrieve rows (documents) containing search term words.  Additional functionality added similar to Google searches, including ranking of search results.
     1. **GIN**--generalized inverted indexes.  Best inverted index for read-heavy operations.  The most common inverted index and often the default.
     1. **GIST**--generalized search tree. Uses hash functions. Potential for hash collisions, but these are checked by RDBMS automatically.  Smaller index size.  Potentially best inverted index for write-heavy operations.  Not as common.
     1. **SP-GiST**--space partitioned generalized search tree.  Mostly used for spatial data like latitude and longitude.
- Inverse indexes are often used for searching natural language documents
    - **Natural language**--ordinary languages.  English, Spanish, Standard Mandarin, Hindi, etc.  Not a programming language.
    - For advanced functionality we must specify a natural language
    - Common strategies employed by inverse indexes include: 
        - Ignore case.  The meaning of lower and uppercase letters is typically equivalent.
        - Ignore stop words.  **Stop words** are very common words and symbols.  
            - E.g. "the", "in", '.', etc.
        - Conflation/stemming.  Treat words with the same stem the same.  This stem is called a **lexeme**.  
            - E.g. "jumps" and "jumped" may all be treated equivalent to the stem, "jump"
- Inverse indexes are also often used for searching programming language documents like JSON, XML, and HTML documents

---

### Dates and Times

- Date and time data is tricky to work with:
    - Dates and times are formatted differently all around the world and even within the same country
    - There are different types of time such as local times (offset from UTC and uses daylight saving time), UTC, Unix time, atomic time, etc.
    - The number of days in a month varies, the number of days in a year varies (leap year) and the number of seconds in a minute can even vary (leap second)
- Luckily there are standard data time formats.  Also, most RDBMS have date time data types that enforce certain formats.
- **Timestamp**--in most RDBMS, a "timestamp" includes both date and time data
- Best practice to store timestamps in UTC with time zone data.  UTC can be converted to local time if an application retrieves our data time data from the database and displays it to a user
- *Note that  each RDBMS has different date time data types.  Notably, SQLite does not even have a date or date-time data type and instead uses strings and date time functions.*

---

### Stored Procedures
- **Procedural language**--vague definition.  Programming language paradigm that focuses on writing steps a program must take to get to a given state (as opposed to objects or more math like functions).  More or less the same as imperative programming/structured paradigms, but with a focus on writing procedures.  
- **Stored Procedure**--store procedure in RDBMS and assign procedure to identifier so we can later call identifier to run procedure.  Stored procedures can optionally accept user arguments when called.  In the context of a RDBMS stored procedures are similar to an SQL script. However, depending on the language used to define the procedure, there may be added functionality not available in base SQL.
- SQL can be used to write procedures.  However, procedures can also be written in other languages.  SQL/PSM defines standards for SQL procedural languages, but each RDBMS has there own flavor.
    1. Oracle--PL/SQL
    1. PostgreSQL--PL/pgSQL
    1. SQL Server--Transact-SQL
    1. IBM DB2--SQL PL
    1. MySQL--similar to SQL/PSM standard
    1. SQLite--does NOT support stored procedures
- Other stand alone programming languages can also be used, but often don't have the full functionality of the RDBMS specific procedural languages:
    1. C
    1. Java
    1. Python
    1. Etc.
- Procedural languages implement control flow features not seen in base SQL such as:
    - If-then statements
    - For loops
    - While loops
- There are pros and cons of stored procedures:
    1. Pros
       1. Reusable code
       1. Use control flow logic unavailable in base SQL
       1. Faster.  Storing procedure in the RDBMS means only the identifier must be passed to the RDBMS over a network and the RDBMS can do fancy optimizations.
       1. Option to set permission levels to access stored procedures
    1. Cons
       1. Must learn procedural language dialect
       1. Debugging and unit testing of stored procedures is difficult
       1. Version control of stored procedure code is difficult
       1. Stored procedure code is not easily ported from one RDBMS to another because of dialect differences
- Typically the cons of stored procedures outweigh the pros, but there are certain circumstances where they are helpful
- Alternatives to stored procedures include:
    1. Reusable code within SQL scripts that are run manually by the user.  These can not implement control flow logic.
    1. Reusable code within other applications run automatically as part of a larger process. Commands from the application may be written in SQL (e.g. Python libraries like sqlite3 and pyscopg) or using an ORM (e.g. SQLAlchemy and Django ORM).  These can use control flow logic built into the other programming language (e.g. Python).

---

### Code Injection

- **Injection**--common hacking technique for databases that are connected to the web.  It is the placement of malicious code in SQL statements, via web page input.  Occurs when a website asks for user input like a user name or password,  but an SQL statement is put in instead which is run unknowingly on the database.
- We'll show a conceptual example  
- E.g. we ask a user for their username.  Let's say their username, `my_username`, is somehow inputted into our SQL code.  It may end up looking like this:

```sql
SELECT *
FROM users
WHERE username = 'BlackKnight1975';
```

- However, a hacker could enter the user name `anything'; DROP TABLE users;'`.  If our entire username is placed within single quotes in the SQL code it may end up looking like this:

```sql
SELECT *
FROM users
WHERE username = 'anything'; DROP TABLE users;'';
```

- The intended query would not return any records, but the following one would drop a table!
- SQL code injection occurs when databases are connected to a public network.  For a website this means that the front end application run on a web browser accepts data from a user (e.g. an SQL statement masquerading as a username).  It passes the user data onto the back end application run on a web server.  The back end program will be written in a language such as PHP, Javascript, Ruby, Python, or Go.  From there, the back end application will place the user data into an SQL statement and send it to the RDBMS. 
- The back end application code can be written in a way that prevents SQL injection.  This involves query placeholders and parameters.
    1. **Query Placeholder**--symbol placed into SQL statement that will later be replaced by a parameter
    1. **SQL Parameter**--values (e.g. data entered by user) that eventually replace the query placeholder
- Back end applications pass the parameter to the RDBMS in such a way that it is only ever treated literally, and never as SQL that could be run.  This prevents SQL code injection.
- E.g. here is an SQL statement that inserts a new row.  The query placeholder is `%s`. Each `%s` will eventually be replaced by the parameter in the following Python tuple.  The Python library `pyscopg` sends the SQL statement and the parameters to PostgreSQL separately.  PostgreSQL replaces the query placeholders with the parameter in a controlled way.

```python
cur.execute(
    "INSERT INTO table_name (column_name_a, column_name_b) VALUES (%s, %s)", 
    (parameter_a, parameter_b)
)
```

---

# PostgreSQL
- Concepts common to all RDBMS have been covered in the above sections
- Software and syntax specific to the PostgreSQL RDBMS are included below

---

## Introduction

- PostgreSQL is an open source relational database management system (RDBMS)
- PostgreSQL began as a project at the University of Berkeley in the 1980s.
- It was originally named POSTGRES as it is the successor (**Post**) to the Ingres (**gres**) DBMS.  Ingres stands for **In**teractive **G**raphics and **Re**trieval **S**ystem.
- In 1996, after years of refinement it was released as PostgreSQL.  Many people still call it Postgres because of tradition or because it is easier to pronounce.
- Over the years it has remained open source and retained a large developer community.  It now rightfully calls itself, "The world's most advanced open source relational database."
- While PostgreSQL primarily focuses on storing data in related tables, in also blends in features of other database models.  This includes the ability to store objects and documents.  For this reason it is also called an "object relational" DBMS.
- Last, but not least, their mascot is an elephant:

![](images/pg_elephant.png)

---

## Software Installation

- Like most DBMS, PostgreSQL uses the client-server model
- The server software is the PostgresSQL RDBMS software
- Popular client software includes:
    - **psql**--open source command line client made specifically for the PostgreSQL RDBMS
    - **pgAdmin**--open source SQL IDE client made specifically for the PostgreSQL RDBMS
    - **DBeaver**--open-source SQL IDE client that can communicate with most RDBMS
    - **JetBrains DataGrip**--proprietary SQL IDE client that can communicate with most RDBMS
- PostgreSQL, psql, and pgAdmin are all installed at the same time with the official PostgreSQL distribution: https://www.postgresql.org/download/.  May be redirected to EDB to download the file.  EDB is a company that manages PostgreSQL databases. They also contribute to PostgreSQL open source code. 
- During installation we'll choose:
    - Installation location file path (or accept default path)
    - Default port.  Often defaults to `5432`.
    - Database superuser name.  Often defaults to `postgres`.
    - Password
- **Superuser**--account with administrator level permissions.  `sudo` sometimes used in commands.  Stands for "Superuser Do".  Where applicable, temporarily elevates the permission level of a user to superuser.

---

## psql

---

### Database Connection

- **Database Connection**--an active link between the SQL client software and the PostgreSQL server software
- When psql is opened, psql always tries to establish a database connection.  To do this it prompts us for the following pieces of information:
    1. **Host**--name of database server.  Which computer running PostgreSQL do we want to connect to?  A database server can manage many databases.  If host not specified defaults to `localhost`.
        - A local host means that the computer currently running the psql client software also has the PostgreSQL server software.   We connect to the computer we are currently using.  
        - A remote host means that the PostgreSQL server software is running on a different computer than the psql client software.  Remote host names are either a URI or IP address. 
    1. **Port**--the network port that PostgreSQL uses.  If not specified, defaults to `5432`.
    1. **Database**--PostgreSQL database name that we want to access.  If not specified, defaults to the operating system username.  This is often `postgres`.
    1. **Username**--username we wish to connect with.  If not specified defaults to the operating system username.  This is often the same as the database name, `postgres`.
    1. **Password**--password associated with username.  psql will prompt us for a password if this isn't provided.  When connecting to a local host, the password is the same password that was declared when PostgreSQL was initially installed.
- Within the psql shell we may provide these pieces of information in multiple ways:
    1. Input pieces of information as prompted by psql
    1. Input flag values with pieces of information (except the password): 
        - `psql -h <HOST_NAME> -p <PORT> -U <USERNAME> <DATABASE_NAME>` 
        - Press enter to move through prompts.  We will receive warning messages about ignored command line arguments. Input password when prompted. 
    1. Input connection string with key-value pair format.  Pairs are separated by spaces (not commas).  It is enclosed in quotes.
        - `psql "host=<HOST_NAME> port=<PORT> dbname=<DATABASE_NAME> user=<USERNAME> password=<PASSWORD>"`
        - Press enter to move through prompts.  We will receive warning messages about ignored command line arguments.
    1. Input connection string with URI format. Quotes appear to be optional (maybe because no spaces?).
        - `psql "postgresql://<USERNAME>:<PASSWORD>@<HOST_NAME>:<PORT>/<DATABASE>"`
        - Press enter to move through prompts.  We will receive warning messages about ignored command line arguments.
- Once a database connection has been established, psql will display the command line prompt.  This is the database name followed by one of the following symbols:
    1. **`=#`**--psql is connected to a host and is ready to accept a new command.  This may be a metacommand or SQL statement.  Current role is superuser.
    1. **`-#`**--psql is connected to a host and is waiting for more information to complete the current command.  Command can be ended by typing in `;`.  Current role is superuser.
    1. **`=>`**--same as `=#`, but indicates user is NOT a superuser
    1. **`->`** --same as `-#`,  but indicates user is NOT a superuser
- If we use defaults and log into our local host the prompt will likely be `postgres=#`

---

### Meta Commands

- After connecting to the database, we can pass normal SQL commands through psql to PostgreSQL
- **psql meta command**--also known as slash or backslash commands.  Any command starting with an unquoted backslash that is processed by psql itself.  
- The format of a psql meta command is the backslash, followed immediately by a command verb (often abbreviated down to a letter), then any arguments.  Arguments are separated from the command verb and other arguments by one or more whitespace characters.

Code | Use
--- | --
`q` | Stop psql from showing more output
`\?` | Print metacommand descriptions
`\h` | Print SQL keywords.  Optionally, specify SQL keyword, `\h <SQL_KEYWORD>`.
`\l` | Lowercase "L".  List all databases on server.
`+` | When `+` included after the command verb it indicates that extra info will be included.  E.g. `\l+`.
`\du` | Print roles/users on server
`\c` | Connect to a database.  Indicate database name, `\c <DATABASE_NAME>`
`\d` | Print tables, views, and sequences in current database. Optionally, specify table to print info for, `\d <TABLE_NAME>`.
`\dt` | Same as `\d`, but only includes tables
`\! cls` | Clear screen
`\q` | Quit psql program

---

## DDL Keywords

- DDL syntax seems to vary between RDBMS more than DML or DQL syntax

---

### CREATE USER

- If we have established a local connection with the default options we will likely be logged in as the superuser and see the prompt `postgres=#`.
- It is recommended that we interact with databases with non-superuser accounts when possible.  This prevents us from accidentally making large changes that are only possible with superuser privileges. For this reason, we'll create a new user and then switch to that new user.

`CREATE USER`--define a new database user (same as "role" in PostgreSQL). Many options can be placed after username.  These are separated with spaces, NOT commas.
```sql
CREATE USER username NOSUPERUSER CREATEDB LOGIN PASSWORD password;
```

- **Session User**--normally the user who initiated the current database connection
- **Current User**--normally equal to the session user.  Relevant for permission checking.

`SELECT SESSION_USER, CURRENT_USER`--print the session user and current user

`SET SESSION AUTHORIZATION`--change session user.  Must be superuser to change session user.
```sql
SET SESSION AUTHORIZATION username;
```

`SET ROLE`--change current user
```sql
SET USER username;
```

- Changing the current user is sufficient as this affects permission checking.  We can verify that `SET ROLE` worked using `SELECT CURRENT_USER`.  We can also see that the psql prompt has changed from `=#` to  `=>`.

---

### CREATE DATABASE
- We can now create a new database.  Note that `createdb` failed for me on Windows, but `CREATE DATABASE` worked.  We can drop our databases when needed.

`CREATE DATABASE`--create database.  Many optional arguments.
```sql
CREATE DATABASE database_name;
```

`DROP DATABASE`--delete a database.  User executing command must be a superuser or database owner.  Must not be currently connected to database.  CAUTION!!! This can not be undone.  CAUTION!!!

```sql
DROP DATABASE database_name;
```

---

### Data Types

---

#### All Data Types

![](images/data_types.png)

![](images/data_types_numeric.png)

![](images/data_types_date_time.png)

---

#### Common Data Types
- The below table list the most common data types

Data Type | Use
--- | ---
`SERIAL` | Autoincrementing positive integer up to ~ 2 billion.  Commonly used for primary key field.
`BOOLEAN` | Boolean values
`CHAR(n)` | Allocates space in the computer memory for the number of characters specified, n, for each cell value.  Only used when all cell values in a column will be exactly the specified length. Used for data like hash values. Not actually that common.
`VARCHAR(n)` | Allocates variable amount of space in the computer memory, up to the specified number of characters.  Only used when we'll never need to store more than the specified number of characters.  Often used when we only want single words.  
`TEXT` | Allocates a variable amount of space with no upper limit.  If we are unsure on an upper character limit, just use TEXT. There is no performance hit.   Used for data like sentences, paragraphs, natural language documents, HTML documents, etc.
`INTEGER` | Commonly used integer data type. ~ -2 billion to ~ +2 billion.  `BIGINT` also common.
`DOUBLE PRECISION` | Double precision floating point.  For real numbers, the most commonly used type. Bad for money and calculations that need to be very "precise".  Faster than `NUMERIC` and `MONEY`.
`NUMERIC(<MAX_PRECISION>, <MAX_SCALE>)` | Arbitrary precision numbers.  Precision is the number of significant digits on either side of the decimal point.  Scale is the number of digits to the right of the decimal point.  Good for money and other times when "precision" matters.  Slower than integers and floating point numbers.
`MONEY` | Similar to `NUMERIC`.  Scale typically fixed at 2.
`DATE` | Year, month, date.  `CURRENT_DATE` will return current `DATE` value.
`TIMESTAMPTZ` | Date and time with time zone information.  `CURRENT_TIMESTAMP` will return current `TIMESTAMPTZ` value in local time (same thing as `NOW())`.
`JSONB` | Binary JSON. PostgreSQL's preferred data type for JSON.

---

#### Casting

`pg_typeof()`--return data type

```sql
pg_typeof(value)
```

`CAST()`--convert value from one data type to another

```sql
CAST(value AS new_data_type)
```

`::`--alternative casting syntax.  More commonly used than `CAST()`.
```sql
value::new_data_type
```

---

#### Arrays

- "PostgreSQL allows columns of a table to be defined as variable-length multidimensional arrays"
- A multidimensional array is simply a nested array

`ARRAY`--indicate array.  Placed after data type.
```sql
CREATE TABLE table_name (
    column_name_a INTEGER ARRAY,
    column_name_b TEXT ARRAY,
);
```

- See documentation for:
    1. Declaring/hinting array length and dimensions
    1. Inserting arrays
    1. Accessing array items with indexes and slices
    1. Updating arrays
- Arrays are not commonly used in relational databases  Most of the time, we want to take advantage of normalization.

E.g. instead of using an array to hold team info and goal info like in the following table:
```sql
CREATE TABLE soccer_game (
    id SERIAL PRIMARY KEY,
    teams TEXT ARRAY,
    goals INTEGER ARRAY
);
```

We'd likely prefer to have a schema like this:
```sql
CREATE TABLE team (
    id SERIAL PRIMARY KEY,
    name TEXT
);

CREATE TABLE soccer_game (
    id SERIAL PRIMARY KEY,
    team_1_id TEXT REFERENCES team(id),
    team_2_id TEXT REFERENCES team(id),
    goals_team_1 INTEGER,
    goals_team_2 INTEGER
);
```

---

### DEFAULT


`DEFAULT`--if no row value is specified for this column during row creation or update, then insert default value

```sql
CREATE TABLE table_name(
    column_name data_type DEFAULT default_value
);
```

In PostgreSQL a common example is for a timestamp column to have a default of `CURRENT_TIMESTAMP`, so that it gets set to the time of row insertion.

```sql
CREATE TABLE table_name(
    record_creation_timestamp TIMESTAMPTZ DEFAULT CURRENT_TIMESTAMP
);
```

---

### GENERATED

`GENERATED`--a generated column is a special column that is always computed from other columns
```sql
CREATE TABLE table_name (
    column_name_a  data_type,
    column_name_b  data_type GENERATED ALWAYS AS (column_a_used_in_an_expression) STORED
);
```

E.g. we can convert distance from centimeters to inches
```sql
CREATE TABLE people (
    height_cm numeric,
    height_in numeric GENERATED ALWAYS AS (height_cm / 2.54) STORED
);
```

---

### Constraints

- State constraints that any new or updated row must meet to be included in table

**Column constraints**--must refer to only one column.  Written to the right of the column creation syntax.  To clarify syntax, we'll use the `UNIQUE` constraint (discussed later).
```sql
CREATE TABLE table_name (
    column_name  data_type UNIQUE
);
```

**Table constraints**--can refer to multiple columns.  Written on own line with parentheses.  To clarify syntax, we'll use the `UNIQUE()` constraint (discussed later).
```sql
CREATE TABLE table_name (
    column_name_a  data_type,
    column_name_b data_type,
    UNIQUE(column_name_a, column_name_b)
);
```

---

#### CHECK

`CHECK`--row value in specified column used in Boolean expression.  Expression/condition must evaluate to true.
```sql
CREATE TABLE table_name (
    column_name  data_type CHECK (condition)
);
```

We can also name constraints.  This can be helpful for error messages or altering constraints.  Below we'll ensure that each record has a positive value in the column.  
```sql
CREATE TABLE table_name (
    column_name  INTEGER CONSTRAINT must_be_positive CHECK (column_name > 0)
);
```

---

#### NOT NULL

`NOT NULL`--row value in specified column must not be NULL.  Always written as a column constraint
```sql
CREATE TABLE table_name (
    column_name  data_type NOT NULL
);
```

---

#### UNIQUE

`UNIQUE`--only allows records with distinct values in this column to be inserted into the table.  Internally, the RDBMS creates an B-tree index for this column.  Can be written as a column constraint or a table constraint.
```sql
CREATE TABLE table_name (
    column_name  data_type UNIQUE
);
```
When written as a table constraint it can refer to multiple columns.  A single column will not always form a logical key and provide unique values.  However, sometimes a combination of two or more columns can be used to form a "compound logical key" that should always be unique.  E.g. county name is unique in each state, but county names may repeat in different states.  We could not use county name as a logical key.  We could use state name and county name as a compound logical key.
    
```sql
CREATE TABLE table_name (
    column_name_a data_type,
    column_name_b data_type,
    UNIQUE(column_name_a, column_name_b)
);
```

---

#### PRIMARY KEY

`PRIMARY KEY`--a combination of `UNIQUE` and `NOT NULL` constraints.  Most often, the `SERIAL` data type used for a table's primary key.
```sql
CREATE TABLE table_name(
    id SERIAL PRIMARY KEY
);
```

When written as a table constraint it can refer to multiple columns.  Like `UNIQUE` above.  Could use to form a compound key.
```sql
CREATE TABLE table_name (
    column_name_a data_type,
    column_name_b data_type,
    PRIMARY KEY(column_name_a, column_name_b)
);
```

---

#### FOREIGN KEY

- `REFERENCES`--specify foreign key column.  Maintains referential integrity.  
- **Referential Integrity**--a foreign key references the primary key in a foreign table.  The record with the referenced primary key is called the **referenced record** or the **parent record**.  The record with the foreign key is called the **referencing record** or **child record**.  Referential integrity prevents records from being inserted into the table with the foreign key, if the record's value in the foreign key column does not have a match in the primary key column of the foreign table.  I.e. it prevent us from using a foreign key value if there is no corresponding primary key.

Below we create a table with a primary key field
```sql
CREATE TABLE table_name_a(
    id SERIAL PRIMARY KEY,
    name TEXT
);
```

Below we create table with both primary and foreign key fields
```sql
CREATE TABLE table_name_b(
    id SERIAL PRIMARY KEY,
    name TEXT,
    table_name_a_id INTEGER REFERENCES table_name_a(id)
);
```

---

### ON DELETE

- `ON DELETE`--specifies what happens to a child/referencing record when the parent/referenced record is deleted

- `ON DELETE RESTRICT`--disallow deletion of parent record.  This is the default behavior.  When only `ON DELETE` typed, it means `ON DELETE RESTRICT`.  

- `ON DELETE CASCADE`--if parent record is deleted, then all the child records are deleted.  Deleting one parent record may delete multiple child records.  If those children are parents to other children and there is the same constraint, then there will be a cascade of record deletions.  This cascade will tidy up a database, getting rid of (hopefully unneeded) rows.

- `ON DELETE SET NULL`--if parent record is deleted then all child records' foreign key values changed to `NULL`. If `ON DELETE SET NULL`, is selected, we must also allow null values in the foreign key column.

- `ON DELETE SET DEFAULT`--same as `ON DELETE SET NULL`, but child foreign key values changed to the default value

---

### ALTER TABLE

`ALTER TABLE`--performs different functions when combined with different keywords

`RENAME TO`--rename table
```sql
ALTER TABLE old_table_name
RENAME TO new_table_name;
```

`RENAME COLUMN`--rename column
```sql
ALTER TABLE table_name
RENAME COLUMN old_column_name TO new_column_name;
```

`ADD COLUMN`--add column
```sql
ALTER TABLE table_name
ADD COLUMN new_column_name data_type constraint;
```

`DROP COLUMN`--delete column
```sql
ALTER TABLE table_name
DROP COLUMN column_name;
```

`ADD`--we can add a constraint using table constraint syntax.  We'll use `UNIQUE()` for the example, but it can also be used for other constraints like `CHECK()` and  `PRIMARY KEY()`.  See documentation for `NOT NULL` and foreign key syntax.
```sql
ALTER TABLE table_name
ADD UNIQUE(column_name);
```

`DROP CONSTRAINT`--drop constraint.  Need identify constraint by name.  If we didn't give it a name initially, can find out its PosgreSQL auto-generated name with psql command `\d <TABLE_NAME>`.
```sql
ALTER TABLE table_name
DROP CONSTRAINT constraint_name;
```

`ALTER COLUMN`--either change column's default value or change column's data type.
```sql
ALTER TABLE table_name
ALTER COLUMN column_name SET DEFAULT default_value;
```

```sql
ALTER TABLE table_name
ALTER COLUMN column_name TYPE data_type;
```

---

## DML Keywords

---

### COPY


`COPY FROM`--copy data from a file to a table.  Each field from the file is inserted, in order, into the specified columns.  

```sql
COPY table_name
FROM 'absolute_path/filename';
```

`COPY TO`--copy data from a table to a file.  Can also copy result set to file.  If a column list is specified, only those columns are copied to file.
```sql
COPY table_name
TO 'absolute_path/filename';
```

- For both, if copy successful, prints out the number of rows copied
- For both, absolute file paths are recommended
- Copy to and from are commonly used with text data and CSV data.  Read documentation to learn more about how escape characters, line breaks, quotes, delimiters, and NULL values are handled.

---

### RETURNING

`RETURNING`--optional clause in `INSERT`, `UPDATE`, and `DELETE` data manipulation statements that returns the modified row(s) in a result set.  Similar to performing a select statement after the data manipulation, however `RETURNING` only returns the rows manipulated.  For inserts returns the inserted row(s).  For updates, returns the updated row(s).  For deletes, it returns the deleted row(s).

```sql
INSERT INTO table_name (column_name)
VALUES (value)
RETURNING *;
```

---

### ON CONFLICT

`ON CONFLICT`--tell RDBMS tell what to do if it runs into a constraint.  Similar to try except statement in Python.

```sql
Try SQL statement
ON CONFLICT (column_name_that_may_cause_conflict, column_name_that...)
DO SQL clause
```

Hypothetically, we have a table with a unique constraint on a column_name_a.  If we try to insert a record with a duplicate value for that column, the constraint will raise and error.  Below we tell the RDBMS to try to insert a record.  If a constraint raises an error because that cell value already exists in column_name_a, then update the record that already exists.  Keep the value in column_name_a the same, but update the value in column_name_b.
```sql
INSERT INTO table_name (column_name_a, column_name_b)
VALUES ('Duplicate value for column a', 'New value for column b')
ON CONFLICT (column_name_a)
DO UPDATE SET column_name_b = 'New value for column b'
```

`ON CONFLICT` is commonly used to try to insert a new record, except update existing record.  It is easier to write and runs faster using a `CASE WHEN` conditional statement.

---

## DQL Keywords

---

### Subquery

- In PostgreSQL, "Subqueries specifying a derived table must be enclosed in parentheses and must be assigned a table alias name "

```sql
SELECT *
FROM (SELECT * FROM table1) AS alias_name
```

---

### RIGHT & FULL JOIN

- In an above section we looked at `CROSS JOIN`, `INNER JOIN`, and `LEFT JOIN`.
- Unlike SQLite, PostgreSQL also supports `RIGHT JOIN` and `FULL JOIN`.  The syntax is the same as the other joins.

---

### INTERSECT & EXCEPT

- In an above section we looked at `UNION`.  PostgreSQL also has `INTERSECT` and `EXCEPT`.

"`INTERSECT` returns all rows that are both in the result of query1 and in the result of query2. Duplicate rows are eliminated unless `INTERSECT ALL` is used.

`EXCEPT` returns all rows that are in the result of query1 but not in the result of query2. (This is sometimes called the difference between two queries.) Again, duplicates are eliminated unless `EXCEPT ALL` is used."

---

### Regular Expressions

- In an above section we looked at `LIKE`.  PostgreSQL also supports regular expressions.
- **Regular Expression (RegEx)**--sequence of characters that form a search pattern. Used to check if specified characters in a specified pattern match a string. Uses wildcards.
- PostgreSQL uses the POSIX dialect of regular expressions
- Regular expressions are similar to `LIKE`, but with  more advanced logic and wildcards
- Regular expressions can be used in multiple places within an SQL statement

Code | Use
--- | ---
`~` | Return TRUE if there is one or more matches.  Similar to `LIKE` operator.
`~*` | Same as `~`, but case insensitive
`!~` | Returns TRUE if there is NOT a match
`+~*` | Same as `!~`, but case insensitive
`substring()` | Returns first match in text column. Like Python's `re.search()`
`regexp_matches()` | Return array of matches.  Like Python's `re.findall()`.

"For each record in the table `table_name`, if that record's cell value in the column `column_name` matches the regex  pattern then pass it to `SELECT`.  Select all columns to include in the result set."
```sql
SELECT *
FROM table_name
WHERE column_name ~ 'pattern with regex wildcards'
```

"For each record in the table `table_name` pass it to `SELECT`.  Select only the first string from the `column_name` column matching the regex pattern to include in the result set.
```sql
SELECT substring(column_name FROM 'pattern with regex wildcards')
FROM table_name
```

---

### Window Functions

- Window Function--"A window function performs a calculation across a set of table rows that are somehow related to the current row. This is comparable to the type of calculation that can be done with an aggregate function. However, window functions do not cause rows to become grouped into a single output row like non-window aggregate calls would. Instead, the rows retain their separate identities. Behind the scenes, the window function is able to access more than just the current row of the query result."

```sql
SELECT 
    column_name_a, 
    column_name_b, 
    function(column_name_c) OVER (PARTITION BY column_name_a)
FROM table_name;
```

For each resident in the state_residents table, select the resident's name for the result set.  Also, temporarily group residents by county, find the average height of each group, and for each resident, include their group's average height in the result set.

```sql
SELECT 
    name,
    avg(height) OVER (PARTITION BY county)
FROM state_residents;
```

- There are more window functions such `rank()`, `lag()`, and `lead()` as well as additional keywords that control window function behavior.

---

## Transactions

- Transaction behavior varies by RDBMS and even varies between client applications
- **Autocommit**--each SQL statement is executed in its own transaction.  Implicit `BEGIN` before SQL statement.  If execution was successful, implicit `COMMIT` after SQL statement.  If there was an error, then  implicit `ROLLBACK` is done.   1 SQL statement = 1 transaction. 
- In PostgreSQL autocommit is the default behavior
- In other RDBMS, we may need to start a transaction with `BEGIN` and end a transaction with `COMMIT` for the SQL statement(s) to be treated as a complete transaction and be run by the RDBMS.
- PostgreSQL uses autocommit.  This is usually good, but sometimes we want a guarantee that multiple tasks are completed in a single transaction.  We don't want our SQL statements separated in a queue with other SQL statements in between.  We may also want a guarantee that multiple SQL statements either all succeed or all fail.  All or nothing.  This is especially important in financial transactions.
- **Multi-statement Transaction**--within a single transaction, perform multiple SQL statements.  
- **Transaction block**--code containing a multi-statement transaction
- **Rollback**--revert database to state at time prior to transaction.  All or nothing.
- `BEGIN;`--start a multi-statement transaction
- `COMMIT;`--end a multi-statement transaction and commit CRUD
- `ROLLBACK; `--end a multi-statement transaction and intentionally rollback CRUD.  Used in conditional statements. 
- A multi-statement transaction  will end in either of three ways:
    - Implicitly rollback CRUD because of error
    - Explicitly rollback CRUD because of `ROLLBACK;`
    - There were no errors and explicitly commit CRUD with `COMMIT;` 

```sql
BEGIN;
SQL_statement;
SQL_statement;
SQL_statement;
COMMIT;
```

- The above is a bit of simplification as transactions can be further controlled with savepoints
- **Save point**--placed after one or more SQL statements in a transaction.  If SQL statements preceding the savepoint had no errors or `ROLLBACK;`, then we save our progress up to that point.  We can rollback to this point if needed.  Savepoints do not commit on their own and we still need to commit the transaction for saved changes to persist.
- `SAVEPOINT`--set savepoint
- `ROLLBACK TO`--rollback to savepoint

```sql
BEGIN;
SQL_statement;
SAVEPOINT savepoint_name;
SQL_statement;
ROLLBACK TO savepoint_name;
COMMIT;
```

- Lastly, note that multi-statement transactions may also speed up operations.  Transaction are sent over a network, from client software to RDBMS server software.  This takes time.  Sending fewer, multi-statement transactions means there is less time spent in transit.
    - E.g. we want to insert 100 rows into a table.  We could let autocommit send 100 separate transactions across the network.  This may be slower than grouping them into a single multi-statement transaction and sending that one transaction across the network.

---

## Stored Procedures

- SQLite does not support stored procedures.  PostgreSQL does and actually allows more than one language for writing stored procedures:
    1. `sql`
    1. `plpgsql`
    1. `c`
    1. `internal`

`CREATE PROCEDURE`--create new stored procedure.  See documentation for arguments.

`CREATE OR REPLACE PROCEDURE`--same as `CREATE PROCEDURE`, but will replace procedure of the same name if it exists

There are two options for formatting when we use SQL as the procedural language:

Option A
```sql
CREATE PROCEDURE procedure_name (parameter_a DATA_TYPE, parameter_b DATA_TYPE)
LANGUAGE SQL
AS $$
SQL_statement;
SQL_statement;
etc.;
$$;
```

Option B
```sql
CREATE PROCEDURE procedure_name (parameter_a DATA_TYPE, parameter_b DATA_TYPE)
LANGUAGE SQL
BEGIN ATOMIC
  SQL_statement;
  SQL_statement;
  etc.;
END;
```

We can later run the stored procedure:
```sql
CALL procedure_name(argument_a, argument_b);
```

---

## Index

- PostgreSQL uses the following index data structures
    1. B-trees
    1. Hash
    1. BRIN
    1. GIN
    1. GiST
    1. SPGiST
- We covered the theory of indexes in an above section.  Below we'll show examples of how to create B-tree and GIN indexes and subsequently read rows utilizing those indexes.

---

### EXPLAIN & ANALYZE

- `EXPLAIN SQL_statement`--prints query plan.  The query plan describes how the SQL statement is run internally by PostgreSQL.  One of the most important pieces of info is the scan type.  An "Index Only Scan" uses indexes and is fast.  A "Seq Scan" is a full table scan and is slower.
- `ANALYZE SQL_statement`--print execution time of SQL statement
- `EXPLAIN ANALYZE SQL_statement`--combine the two
- Two other useful metrics for tables include:
    - `pg_relation_size('table_name')`--size of data in table (excludes indexes)
    - `pg_indexes_size('table_name')`--size of indexes in table
- Note that after index created, when rows inserted, index must take time to update.  If there are many rows inserted, the index may take seconds to minutes to update.  While updating, any reads will be a sequential scan.
- Note that PostgreSQL will skip using an index if the number of records in the table are small.  So even if we did everything correctly, `EXPLAIN` may still tell us there was a sequential scan.  When practicing, we can add a few thousand dummy rows to convince PostgreSQL it needs to read with our index.

---

### B-Tree Index

- We'll create a B-tree indexes for a column
- B-trees are the default index in PostgreSQL so we do not need to specify the index type

Create B-tree index for a column that does not already have the UNIQUE constraint (that would be redundant)
```sql
CREATE INDEX index_name
ON table_name (column_name)
WITH (deduplicate_items = off);
```

Read with B-tree index
```sql
SELECT *
FROM table_name
WHERE column_name > 10;
```

Create a B-tree index on an expression that uses a column.  Remember that the function below really inputs a single row's cell value.  It must also return a single value ("scalar").
```sql
CREATE INDEX index_name
ON table_name (function_name(column_name));
```

Read with B-tree index
```sql
SELECT *
FROM table_name
WHERE function_name(column_name) > 10;
```

- For index to be used in later reads, the function/expression in the `CREATE INDEX` statement must match the function/expression in the `WHERE` clause of the read statement.  If this does not match, the index will not be used and there will be a sequential scan.

---

### GIN Index
- We'll create a GIN index for a "natural language" TEXT column

Code | Use
--- | ---
`GIN()` | Specify we are creating a GIN index
`to_tsvector('language', document)` | Parses document, returning tsvector.  `'language'` is the language of the TEXT field written in lower case.  `document` column is typically a column with a TEXT data type.  Each TEXT column cell represents a document.  Splits each document into individual words.  Automatically ignores case, ignores stop words, and stems words.  Keeps track of position of words within each document.  Stores this info in tsvector data type. "ts" stands for text search.  At its core, the tsvector is an inverted index that maps words to which document they came from.
`to_tsquery('language', 'query')` | Parses query, returning tsquery.  Query is short string of words.  Each word separated by operator.  `&` = AND.  `\|` = OR. `!` = NOT. `<->` = followed by.  Control order of operation with parentheses.  E.g. `'Hello <-> world'`.  There are many related function like `websearch_to_tsquery()`, which modify how query is parsed.
`@@` | Used in `WHERE` clause to ask if tsquery has matches in tsvector.  I.e does that record's document contain words that match the search query?

Create GIN index for TEXT column
```sql
CREATE INDEX gin_name
ON table_name
USING GIN(to_tsvector('language', column_name));
```

Read with GIN index
```sql
SELECT *
FROM table_name
WHERE 
  to_tsquery('language', 'query') @@
  to_tsvector('language', column_name);
```

- For index to be used, `to_tsvector()` in `USING` and `WHERE` must match. I.e. must match how we create index with how we search table with index.  If this does not match, the index will not be used and there will be a sequential scan.

---

## JSONB

- JSON began to be used around the year 2000 and continues to become increasingly important
- JSON document databases, like MongoDB, arrived around 2010 to store this data
- As a reaction to this, most relational databases added the ability to store JSON and binary JSON
- SQLite does not have a JSON specific data type, but PostgreSQL does
- Postgres has gradually added in full support for JSON data over the years by adding the following data types:

1. HSTORE
    - Released in PostgreSQL 8.3
    - Key value pairs
    - Not built into latest versions of PostgreSQL, but available as an extension
1. JSON
    - Released in PostgreSQL 9.2
    - JSON stored as string text
    - Preserves whitespace and ordering of keys
    - Preserves duplicate keys
    - Does NOT support full-text-search, GIN indexing, and many JSON functions    
1. JSONB
    - Released in PostgreSQL 9.4
    - JSON stored in **B**inary representation
    - Whitespace removed
    - Within a single object, duplicate object names (keys) are removed.  If duplicate, last key is kept.
    - Object names (keys) are sorted
    - Supports full-text-search, GIN indexing, and many JSON functions
    - JSONB is almost always the preferred data structure

- JSON was designed to be simple and language agnostic.  Therefore, it only accepts a handful of simple data structures.

JSON "Primitive" Type | PostgreSQL Type | Notes
--- | --- | ---
string | text | `\u0000` is disallowed, as are Unicode escapes representing characters not available in the database encoding
number | numeric | `NaN` and `infinity` values are disallowed
boolean | boolean | Only lowercase `true` and `false` spelling are accepted
null | (none) | SQL `NULL` is a different concept

- **Document**--each record's cell value in the JSONB column is said to contain a "document"
- When working with a table with a JSONB column, we are typically going through each document.  We often extract values from each JSON document or determine if each document meets a condition.

---

### JSONB Operators

---

#### Extraction Operators

Extraction operators for JSON and JSONB:

Code | Use
--- | ---
`->` | Return extracted data as JSON(B).  Extract JSON(B) object by key.  Or extract array item by index position.  Index position in this context is different from indexes like B-trees and GINS.  Index from 0 and allows for negative index.
`->>` | Same as `->`, but return extracted data as TEXT
`#>` | Return extracted data as JSON(B).  Extracts JSON sub-object at the specified path, where path elements can be either object keys or array indexes.
`#>>` | Same as `#>`, but return extracted data as TEXT

Pretend the table schema is:

`table_name`

id | jsonb_column_name
--- | ---
1 | '{"characters": ["Calvin", "Hobbes"]}'

The SQL statement below returns: `'["Calvin", "Hobbes"]'`
```sql
SELECT jsonb_column_name ->> 'characters'
FROM table_name;
```

The SQL statement below returns: `"Hobbes"`.  We first extract the array and then extract the second item in the array.
```sql
SELECT jsonb_column_name #>> '{characters, 1}'
FROM table_name;
```

The SQL statement below returns: the first record.  Notice how once we extract a scalar value from a JSON string we can use it with our normal operators.
```sql
SELECT *
FROM table_name
WHERE jsonb_column_name #>> '{characters, 1}' = 'Hobbes';
```

- Note JSON uses double quotes for strings and keys.  Single quotes are only used around the entire JSON string.  When issuing SQL statements, it appears that we often use single quotes around scalar literals.  We still use correct  JSON formatting when we write JSON strings with anything more complex than scalar values.  E.g. we still use double quotes when writing strings or keys within JSON arrays or objects.

---

#### Containment & Existence Operators

Common operators (there are more) for JSONB only (we often say JSON, but remember it is stored internally as JSONB):

Code | Use
--- | ---
`@>` | **Containment/Path operator**.  Return true or false.  Does the first JSON value contain the second? 
`?`  | **Existence operator**.  Return true or false.  Does the string exist as a top-level key or array item within the first JSON value?

- Note that for the containment operator the nested structure matters.  For the second JSON value, we must write out the path.  If our first JSON value starts at the top level (the first JSON value is the entire JSON document) the second JSON value path starts at the top level:
    - "The general principle is that the contained object must match the containing object as to structure and data contents, possibly after discarding some non-matching array elements or object key/value pairs from the containing object."

```sql
SELECT * 
FROM table_name
WHERE jsonb_column_name @> '{"characters": ["Calvin", "Hobbes"]}';
```
Returns: true so result set contains the first record

```sql
SELECT * 
FROM table_name
WHERE jsonb_column_name ? 'characters';
```
Returns: true so result set contains the first record. 

- Note that in our `WHERE` clause, the first value is a JSONB.  The second is a JSON string.  PostgreSQL implicitly casts the JSON string into JSONB before performing the operation.

---

#### Other Operators

Code | Use
--- | ---
`::` | Cast data to another type
`\|\|` | "Concatenates two jsonb values. Concatenating two arrays generates an array containing all the elements of each input. Concatenating two objects generates an object containing the union of their keys, taking the second object's value when there are duplicate keys. All other cases are treated by converting a non-array input into a single-element array, and then proceeding as for two arrays. Does not operate recursively: only the top-level array or object structure is merged."

E.g. in the following extract a JSONB value to a JSONB value.  Then we cast it to the text type.  We could have instead used `#>>`.

```sql
SELECT jsonb_column_name #> '{characters, 1}':: text
FROM table_name;
```
Returns: `"Hobbes"`


E.g. update a table by concatenating a new key-value pair onto the top level
```sql
UPDATE table_name
SET jsonb_column_name = jsonb_column_name || '{"author": "Bill Watterson"}'
WHERE id = 1;
```
Our updated table would look like:

`table_name`

id | jsonb_column_name
--- | ---
1 | '{"characters": ["Calvin", "Hobbes"], "author": "Bill Watterson"}'

---

### JSONB Indexes

- Indexes can easily be added to JSONB.  We can use B-trees, GIN, Hash, etc.

B-tree expression index.  Index by the values paired with 'author' key.  Index values from specified key, NOT the entire JSONB column.
```sql
CREATE INDEX btree_index_name
ON table_name 
USING BTREE ((jsonb_column_name->>'author'));
```

Read using B-tree.  We can treat this index like other expression indexes.  We match expressions in the create index statement with the expression in the select statement.
```sql
SELECT *
FROM table_name
WHERE jsonb_column_name->>'author' = 'Bill Watterson';
```

GIN for entire JSONB column.  By default GIN on a JSONB column uses `jsonb_ops`.
```sql
CREATE INDEX gin_index_name
ON table_name 
USING GIN (jsonb_column_name);
```
Read using `jsonb_ops` GIN.  We do NOT have to have matching expressions like the B-tree.  Instead we can use either the containment (path) operator, `@>`, or the existence operator, `?`.
```sql
SELECT *
FROM table_name
WHERE jsonb_column_name ? 'author';
```

GIN for entire JSONB column.  Specify `jsonb_pathops`.
```sql
CREATE INDEX gin_index_name 
ON table_name
USING GIN (jsonb_column_name jsonb_path_ops);
```
Read using `jsonb_path_ops` GIN.  We do NOT have to have matching expressions like the B-tree.  Instead we can use the containment (path) operator, `@>`. Our index will NOT be used if we try to use the existence operator, `?`.
```sql
SELECT *
FROM table_name
WHERE jsonb_column_name @> '{"characters": ["Calvin", "Hobbes"]}';
```

Common indexes compared (when they are used for JSONB data):

Index | Size | Search Flexibility | Speed
--- | --- | -- | ---
B-tree | Low | Low | High
GIN `jsonb_path_ops` | Medium | Medium | Medium
GIN `jsonb_ops` | High | High | Low

---

### JSONB More to Explore

- **JSONB Subscripting**--"JSONB data types supports array style subscripting expressions that allows us to extract and modify elements".  I.e. subscript like we do for nested Python dictionaries and lists, often "drilling down" from the top-level.
- **SQL/JSON path language**--syntax to efficiently query JSON data

---

## Psycopg

- **Psycopg**--Python library that allows us to send SQL commands to PostgreSQL from within a Python script.  Allows a Python interpreter to act as a command line client.  Psycopg follows the Python DB API 2.0 specifications.  Name derived from misspelling of "psycho pg".  They forgot the "h".  "pg" stands for PostgreSQL.  
-  Most recent version is version 3, which is under development and only available on PIP currently.  Name of library is `psycopg`, not `psycopg3`.
- **Python DB API 2.0 specifications**--standards for command syntax for library users as well as standards for Python library developers. "This API has been defined to encourage similarity between the Python modules that are used to access databases."  
    - E.g. in both `sqlite3` and `psycopg` we create connection object and cursor objects with similar methods

---

### Connection Objects

Code | Use
--- | ---
`import psycopg` | Import module
`psycopg.connect("<CONNECTION_STRING>")` |  Return connection object.  Connection string often contains info about the host, port, database name, username, and password.  Can be written in either of the two standard connection string formats.  These are the same formats that allow us to connect with the psql client.  Connection object conventionally named `conn`.
`host=<HOST_NAME> port=<PORT> dbname=<DATABASE_NAME> user=<USERNAME> password=<PASSWORD>` | Connection string key-value pair format
`postgresql://<USERNAME>:<PASSWORD>@<HOST_NAME>:<PORT>/<DATABASE>` | Connection string URI format
`conn.commit()` | Commit any pending transaction to the database.  Forces RDBMS to write any changes to non-volatile memory so they persist.  Makes CUD official.
`conn.close()` | Close database connection
`conn.cursor()` | Return cursor object.  The cursor object allows interaction with the database.  The cursor object is similar to a file handle.  Conventionally named `cur`. There can be more than one cursor object.

---

### Cursor Objects

Code | Use
--- | ---
`cur.execute("<SQL_STATEMENT>")` | Execute SQL statement.  SQL statement is a passed to RDBMS.
`cur.fetchone()` | Assuming we have ran a `SELECT` statement already, return next row of SQL query result set.  A row is represented as tuple.  Each cell value is a tuple item.  If no rows in result set returns `None`.  
`cur.fetchmany()` |Same as `.fetchone()`, but returns a specified number of rows from result set.  A list of row tuples.  If no rows in result set then returns empty list.
`cur.fetchall()` | Same as `.fetchmany()`, but returns all rows in result set
`for i in cur:` | Assuming we have already ran a `SELECT` statement, the cursor object can act as a generator that we can loop through. 
`cur.close()` | Close cursor object. Unsure on use case.
`with conn.cursor() as cur:` | "Cursor context". Unsure on use case.

---

### Passing Arguments

- "Most of the times, writing a program you will have to mix bits of SQL statements with values provided by the rest of the program.  Passing parameters to a SQL statement happens in functions such as `.execute()` by using `%s` placeholders in the SQL statement, and passing a sequence of values as the second argument of the function."  Values go in Python tuple or list.

```python
cur.execute("""
    INSERT INTO some_table (id, created_at, last_name)
    VALUES (%s, %s, %s);
    """,
    (10, datetime.date(2020, 11, 18), "O'Reilly"))
```

- "Named arguments are supported too using `%(<NAME>)s` placeholders in the query and specifying the values into a mapping. Using named arguments allows to specify the values in any order and to repeat the same value in several places in the query."  Values go in Python dictionary.

```python
cur.execute("""
    INSERT INTO some_table (id, created_at, updated_at, last_name)
    VALUES (%(id)s, %(created)s, %(created)s, %(name)s);
    """,
    {'id': 10, 'name': "O'Reilly", 'created': datetime.date(2020, 11, 18)})
```

- We can also write the SQL statement as a Python string, assign it to a variable, and then use that variable in the `.execute()` statement.

```python
 # No single quotes enclosing the query placeholder
SQL = "INSERT INTO authors (name) VALUES (%s)"  

data = ("O'Reilly", )
cur.execute(SQL, data)  # Note: no % operator
```

- CAUTION!!! Follow formatting to prevent SQL injection!
- When these formats are followed, Psycopg sends the SQL statement and the parameters to PostgreSQL separately.  PostgreSQL replaces the query placeholders with the parameter in a way that only allows the parameter to act as literal value and never as an SQL statement.  This is called **server side binding**.  This prevents SQL code injection.
- Server side binding is possible for `SELECT`, `INSERT`, `UPDATE`, and `DELETE` statements
- Where not possible, we can use **client side binding** using the objects from the `sql` module:

```python
from psycopg import sql

conn.execute(sql.SQL("CREATE TABLE foo (id int DEFAULT {})").format(42))
 # This will correctly quote the password
coINTERSECT returns all rows that are both in the result of query1 and in the result of query2. Duplicate rows are eliminated unless INTERSECT ALL is used.

EXCEPT returns all rows that are in the result of query1 but not in the result of query2. (This is sometimes called the difference between two queries.) Again, duplicates are eliminated unless EXCEPT ALL is used.INTERSECT returns all rows that are both in the result of query1 and in the result of query2. Duplicate rows are eliminated unless INTERSECT ALL is used.

EXCEPT returns all rows that are in the result of query1 but not in the result of query2. (This is sometimes called the difference between two queries.) Again, duplicates are eliminated unless EXCEPT ALL is used.nn.execute(sql.SQL("ALTER USER john SET PASSWORD {}").format(password))
```

---

### Data Type Adaptations

- Many standard data types are implicitly adapted between Python and PostgreSQL. These adaptation can be customized.
- Note that we sometimes write PostgreSQL data type aliases

Python to PostgreSQL

Python | PostgreSQL
--- | ---
bool | boolean
int | smallint, integer, bigint, or numeric
float | float8
Decimal | numeric (decimal)
str | varchar or text
bytes and bytearray | bytea
date | date
time |time (if no tz)
time | timetz (if tz)
datetime | timestamp (if no tz)
datetime | timestamptz (if tz)
timedelta | interval
json string | See documentation
list (homogeneous) | n-dimensional array
uuid.UUID | uuid

PostgreSQL to Python

PostgreSQL | Python
--- | ---
boolean | bool
smallint, int, and bigint | int
float8 and float4 | float
numeric | Decimal
char, varchar, and text | str
bytea | bytes
date | date
time and timetz | time
timestamp and timestamptz | datetime
interval | timedelta
json and jsonb | See documentation
n-dimensional array | list
uuid | uuid.UUID

---

### Psycopg Transactions
- The default behavior of Psycopg is different from PostgreSQL + psql
- It is recommended that we imitate the default behavior of PostgreSQL + psql by doing the following:
    1. Use connection context
    1. Use autocommit connection, either passing `autocommit=True` as `connect()` parameter or setting the attribute `conn.autocommit = True`
    1. Use with transaction context to explicitly manage transactions only where needed
- The following sections explain how to do this and provide examples taken from the Psycopg documentation

---

#### Default Behavior
- Most PostgreSQL clients have autocommit ON by default.  To explicitly run a single or multi-statement transaction we must use the keywords `BEGIN` and `COMMIT`.
- The Psycopg client has autocommit OFF by default.  A transaction is started implicitly when any SQL statement is executed with the `.execute()` method.  However, we must explicitly call the `.commit()` method to commit the transaction.
    - E.g. in the following, we implicitly start a transaction, but never explicitly commit the transaction.  We fail to make an insert.

```python
conn = psycopg.connect()

 # Creating a cursor doesn't start a transaction or affect the connection
 # in any way.
cur = conn.cursor()

cur.execute("SELECT count(*) FROM my_table")
 # This function call executes:
 # - BEGIN
 # - SELECT count(*) FROM my_table
 # So now a transaction has started.

 # If your program spends a long time in this state, the server will keep
 # a connection "idle in transaction", which is likely something undesired

cur.execute("INSERT INTO data VALUES (%s)", ("Hello",))
 # This statement is executed inside the transaction

conn.close()
 # No COMMIT was sent: the INSERT was discarded.
```  

- **Note that even if the transaction is not committed, `SELECT` statements still read data from the database successfully.**

---

#### Connection Context

- When our connection to PostgreSQL is short, we can use the **connection context** manager syntax:
    - `with psycopg.connect("<CONNECTION_STRING>") as conn`
    - Indented code that follows is a "code block"  
    - If any exception is raised within the code block, the transaction is rolled back. 
    - When we de-indent the code block, the connection context manager implicitly calls `.commit()` on any open transactions and then implicitly calls `.close()`.
    - `conn` is a conventional variable name given to connection object
    - Connection context on its own doesn't change autocommit.  Instead it helps us not forget `.commit()` and `.close()`

```python
with psycopg.connect() as conn:

    cur = conn.cursor()

    cur.execute("SELECT count(*) FROM my_table")
    # This function call executes:
    # - BEGIN
    # - SELECT count(*) FROM my_table
    # So now a transaction has started.

    cur.execute("INSERT INTO data VALUES (%s)", ("Hello",))
    # This statement is executed inside the transaction

 # No exception at the end of the block:
 # COMMIT is executed.
 # Connection closed
```

---

#### Autocommit
- Connection context on its own may cause problems if there is significant time between the start and end of our transaction. If our code block contained time.sleep(5) our transaction would remain *idle in transaction* for 5 seconds.  This may slowdown the RDBMS.
- It is recommended to imitate the default behavior of PostgreSQL and instead use the Psycopg autocommit setting:
    - `with psycopg.connect("<CONNECTION_STRING>", autocommit=True) as conn:`
- The below code mimics the default behavior of PostgreSQL + psql. 1 SQL statement = 1 transaction.

```python
with psycopg.connect(autocommit=True) as conn:

    cur = conn.cursor()

    cur.execute("SELECT count(*) FROM my_table")
    # This function call now only executes:
    # - SELECT count(*) FROM my_table
    # and no transaction starts.

    cur.execute("INSERT INTO data VALUES (%s)", ("Hello",))
    # The result of this statement is persisted immediately by the database

 # The connection is closed at the end of the block but, because it is not
 # in a transaction state, no COMMIT is executed.
```

---

#### Transaction Context
- When autocommit is on, to explicitly run a single or multi-statement transaction we must use **transaction context** syntax:
    - `with conn.transaction():`  No alias needed.
    - When the transaction context is entered, a transaction is explicitly started
    - Indented code that follows is a "code block"  
    - If any exception is raised within the code block, the transaction is rolled back 
    - When we de-indent leaving the transaction context the transaction is committed
        
```python
with psycopg.connect(autocommit=True) as conn:

    cur = conn.cursor()

    cur.execute("SELECT count(*) FROM my_table")
    # The connection is autocommit, so no BEGIN executed.

    with conn.transaction():
        # BEGIN is executed, a transaction started

        cur.execute("INSERT INTO data VALUES (%s)", ("Hello",))
        cur.execute("INSERT INTO times VALUES (now())")
        # These two operation run atomically in the same transaction

    # COMMIT is executed at the end of the block.
    # The connection is in idle state again.

 # The connection is closed at the end of the block.
```

---

## SQL Cookbook

---

### Dummy Data

- It can be helpful to insert dummy data into tables to practice with

Code | Use
--- | ---
`generate_series(start integer, stop integer [step integer])` | Return set of integers (similar to Python's `range()`).   However, it is more like a single column table with many rows.
`repeat(text, integer)` | Return text.  Repeat input text the specified number of times and concatenate it all together. 
`random()` | Return random double precision number between 0 and 1. 1 <= x < 1.0
`round()` | Return rounded number.  Input must be numeric number.

Generated set with only numbers
```sql
SELECT generate_series(2,4);
```

Generated set with numbers concatenated to string
```sql
SELECT 'I am number ' || generate_series(2,4);
```

Random number. Then a random number multiplied.  Then a random number multiplied and cast to an integer.
```sql
SELECT random();
SELECT random() * 100;
SELECT (random() * 100)::INTEGER;
```


Now we'll create an example table and fill it with dummy data. The insert is a `INSERT INTO SELECT`. We first create a 1 column table and give it an alias.  Then we use that alias for the column in the select statement.  We also use that alias with a column expression that performs concatenation and implicit casting.  Lastly, our random column defaults to making random integers between 0 and 100
```sql
CREATE TABLE dummy_table(
    id SERIAL PRIMARY KEY,
    dummy_integer INTEGER,
    dummy_text TEXT,
    dummy_random INTEGER DEFAULT (random() * 100)::INTEGER
);

INSERT INTO dummy_table (dummy_integer, dummy_text) 
    SELECT generated_series, 'I am number ' || generated_series
    FROM generate_series(1,100) AS generated_series;

SELECT *
FROM dummy_table;
```

- That being said, we could also just download example data sets to work with

---

### Normalize Tables

---

#### One to One

- Our table has two columns that represent two separate subjects.  **We pretend that the subjects have a one to one relationship**. One color can be one fruit.
- Pretend our original table is storing data for two subjects.  Because we have two subjects with a one to one relationship we do NOT have vertical repetition. 

id | name | color_name
--- | --- | ---
1 | 'Cherry' | 'Red'
2 | 'Orange' | 'Orange

- However, our goal may still be to normalize this table by splitting the two subjects into two tables and connecting them with a primary and foreign key.  While not necessary here, if these subjects had relationships with other tables in the database we benefit from normalizing this information.  
    - E.g. color information may also be related to vegetables, nuts, and grain tables.  We may want to join color data to these other tables without also joining fruit data.
- We would eventually want the following.

`fruit`

id | name | color_id
--- | --- | ---
1 | 'Cherry' | 1
2 | 'Orange' | 2

`color`

id | name
--- | ---
1 | 'Red'
2 |'Orange'

- The process for normalizing a table with one to one relationships is very similar to  one to many relationships and will be covered in the next section

---

#### One to Many

- Our table has two columns that represent two separate subjects.  **We pretend that the subjects have a one to many relationship**. One color can be many fruits. 
- Pretend our `fruit` table is storing data for two subjects.  Because we have two subjects with a one to many relationship we have have vertical repetition. 

`fruit`

id | name | color_name
--- | --- | ---
1 | 'Apple' | 'Red'
2 | 'Cherry' | 'Red'
3 | 'Orange' | 'Orange

- Our goal is to normalize this original table by splitting the two subjects into two tables and connecting them with a primary and foreign key.  We eventually want a `fruit` and a `color` table.

`fruit`

id | name | color_id
--- | --- | ---
1 | 'Apple' | 1
2 | 'Cherry' | 1
3 | 'Orange' | 2

`color`

id | name
--- | ---
1 | 'Red'
2 |'Orange'

- We'll first create the original table with vertical repetition:

```sql
CREATE TABLE fruit (
    id SERIAL PRIMARY KEY,
    name TEXT UNIQUE,
    color_name TEXT
);

INSERT INTO fruit (name, color_name)
VALUES 
    ('Apple', 'Red'),
    ('Cherry', 'Red'),
    ('Orange', 'Orange');
```

1. Create a new table so we can eventually separate subjects:

```sql
CREATE TABLE color (
    id SERIAL PRIMARY KEY,
    name TEXT UNIQUE
);
```
`color` table becomes:

id | name
--- | ---

2.  Select distinct from the original table's `color_name`  field and place into the new `color` table's `name` field.  The RDBMS will automatically populate the new table primary key field with integers.  The new table is complete. 

```sql
INSERT INTO color (name)
SELECT DISTINCT color_name
FROM fruit;
```
`color` table is now complete:

id | name
--- | ---
1 | 'Red'
2 |'Orange'

3. Add foreign key field to the original table that references the new table's primary key

```sql
ALTER TABLE fruit
ADD COLUMN color_id INTEGER REFERENCES color(id) ON DELETE CASCADE;
```
`fruit` table becomes:

id | name | color_name | color_id
--- | --- | --- | ---
1 | 'Apple' | 'Red' | NULL
2 | 'Cherry' | 'Red' | NULL
3 | 'Orange' | 'Orange | NULL

4. Update the foreign key field.  For each record in the original table, set the record's cell in the foreign key field equal to a cell value in the primary key field from the new table.  We match these records based on their color values stored in the `color_name` and `name` fields.  This is done with a subquery.  We effectively use an outer and inner for loop.  The outer goes through each record in the original table.  The inner goes through each record in the new table.

```sql
UPDATE fruit
SET color_id = (
    SELECT id
    FROM color
    WHERE fruit.color_name = color.name
);
```
`fruit` table becomes :

id | name | color_name | color_id
--- | --- | --- | ---
1 | 'Apple' | 'Red' | 1
2 | 'Cherry' | 'Red' | 1
3 | 'Orange' | 'Orange | 2

5. Delete `color_name` field in the original table.  Table now normalized.

```sql
ALTER TABLE fruit
DROP COLUMN color_name;
```
`fruit` table becomes :

id | name | color_id
--- | --- | ---
1 | 'Apple' | 1
2 | 'Cherry' | 1
3 | 'Orange' | 2

6. We can JOIN the tables back together

```sql
SELECT *
FROM fruit
INNER JOIN color
ON fruit.color_id = color.id;
```

---

Here is the complete SQL script for normalizing a table with one to many relationships:

```sql
-- Drop tables from database
DROP TABLE IF EXISTS fruit;
DROP TABLE IF EXISTS color;

CREATE TABLE fruit (
    id SERIAL PRIMARY KEY,
    name TEXT UNIQUE,
    color_name TEXT
);

INSERT INTO fruit (name, color_name)
VALUES 
    ('Apple', 'Red'),
    ('Cherry', 'Red'),
    ('Orange', 'Orange');

SELECT * FROM fruit;

CREATE TABLE color (
    id SERIAL PRIMARY KEY,
    name TEXT UNIQUE
);

INSERT INTO color (name)
SELECT DISTINCT color_name
FROM fruit;

ALTER TABLE fruit
ADD COLUMN color_id INTEGER REFERENCES color(id) ON DELETE CASCADE;

UPDATE fruit
SET color_id = (
    SELECT id
    FROM color
    WHERE fruit.color_name = color.name
);

ALTER TABLE fruit
DROP COLUMN color_name;

-- Display split normalized tables
SELECT * FROM fruit;
SELECT * FROM color;

-- Join tables together for display
SELECT *
FROM fruit
INNER JOIN color
ON fruit.color_id = color.id;
```

---

#### Many to Many

- Our table has two columns that represent two separate subjects.  **We pretend that they have a many to many relationship**. One color can be many fruits. One fruit can be many colors.
- Pretend our `original` table has vertical repetition in multiple fields:

`original`

id | fruit_name | color_name
--- | --- | ---
1 | 'Apple' | 'Red'
2 | 'Apple' | 'Yellow'
3 | 'Cherry' | 'Red'
4 | 'Orange' | 'Orange'

- Our goal is to normalize this table by splitting it into three tables.  A `fruit` table, a `color` table, and a `connection` table.  We eventually want the following:

`fruit`

id | name
--- | ---
1 | 'Apple'
2 | 'Cherry'
3 | 'Orange'

`color`

id | name
--- | ---
1 | 'Red'
2 | 'Orange'
3 | 'Yellow'

`connection`

fruit_id | color_id
--- | ---
1 | 1
1 | 3
2 | 1
3 | 2

- We'll first create our `original` table with vertical repetition:

```sql
CREATE TABLE original (
    id SERIAL PRIMARY KEY,
    fruit_name TEXT,
    color_name TEXT
);


INSERT INTO original (fruit_name, color_name)
VALUES 
    ('Apple', 'Red'),
    ('Apple', 'Yellow'),
    ('Cherry', 'Red'),
    ('Orange', 'Orange');
```

1.  Create a new table for each subject

```sql
CREATE TABLE fruit (
    id SERIAL PRIMARY KEY,
    name TEXT UNIQUE
);

CREATE TABLE color (
    id SERIAL PRIMARY KEY,
    name TEXT UNIQUE
);
```

`fruit` table becomes:

id | name
--- | ---

`color`  table becomes:

id | name
--- | ---

2. Insert into  `fruit` table distinct values from the `original` table `fruit_name` field.    Do the same for color.  These tables are now complete.

```sql
INSERT INTO fruit(name)
SELECT DISTINCT fruit_name
FROM original;

INSERT INTO color(name)
SELECT DISTINCT color_name
FROM original;
```
`fruit` table complete:

id | name
--- | ---
1 | 'Apple'
2 | 'Cherry'
3 | 'Orange'

`color` table complete:

id | name
--- | ---
1 | 'Red'
2 | 'Orange'
3 | 'Yellow'

3. Create a new connection table

```sql
CREATE TABLE connection(
    id SERIAL PRIMARY KEY,
    fruit_name TEXT,
    fruit_id INTEGER REFERENCES fruit(id) ON DELETE CASCADE,
    color_id INTEGER REFERENCES color(id) ON DELETE CASCADE,
    color_name TEXT,
    UNIQUE (fruit_id, color_id)
);
```

`connection` table becomes:

fruit_name | fruit_id  | color_id | color_name
--- | --- | --- | ---

4. Insert into the connection table fields `fruit_name` and `color_name` from the `original` table.

```sql
INSERT INTO connection (fruit_name, color_name)
SELECT fruit_name, color_name
FROM original;
```

`connection` table becomes:

id | fruit_name | fruit_id  | color_id | color_name
--- | --- | --- | --- | ---
1 | 'Apple' | NULL | NULL | 'Red'
2 | 'Apple' | NULL | NULL | 'Yellow'
3 | 'Cherry' | NULL | NULL | 'Red'
4 | 'Orange' | NULL | NULL | 'Orange'


5. Update `connection` table `fruit_id` foreign key field with corresponding `fruit` `id` primary keys.  Do the same for color. 

```sql
UPDATE connection
SET fruit_id = (
    SELECT id
    FROM fruit
    WHERE connection.fruit_name = fruit.name
);

UPDATE connection
SET color_id = (
    SELECT id
    FROM color
    WHERE connection.color_name = color.name
);
```

`connection` table becomes:

id | fruit_name | fruit_id  | color_id | color_name
--- | --- | --- | --- | ---
1 | 'Apple' | 1 | 1 | 'Red'
2 | 'Apple' | 1 | 3 | 'Yellow'
3 | 'Cherry' | 2 | 1 | 'Red'
4 | 'Orange' | 3| 2 | 'Orange'

6. Alter `connection` table, dropping the `fruit_name` and `color_name` fields. Connection table complete.

```sql
ALTER TABLE connection
DROP COLUMN fruit_name;

ALTER TABLE connection
DROP COLUMN color_name;
```

`connection` table complete:

id | fruit_id | color_id
--- | --- | ---
1 | 1 | 1
2 | 1 | 3
3 | 2 | 1
4 | 3 | 2

7. We can JOIN the tables back together

```sql
SELECT *
FROM fruit
INNER JOIN connection ON connection.fruit_id = fruit.id
INNER JOIN color ON connection.color_id =color.id;
```

---

Here is the complete SQL script for normalizing a table with many to many relationships:

```sql
-- Drop tables
DROP TABLE original;
DROP TABLE connection;
DROP TABLE fruit;
DROP TABLE color;

CREATE TABLE original (
    id SERIAL PRIMARY KEY,
    fruit_name TEXT,
    color_name TEXT
);

INSERT INTO original (fruit_name, color_name)
VALUES 
    ('Apple', 'Red'),
    ('Apple', 'Yellow'),
    ('Cherry', 'Red'),
    ('Orange', 'Orange');

SELECT * FROM original;

CREATE TABLE fruit (
    id SERIAL PRIMARY KEY,
    name TEXT UNIQUE
);

CREATE TABLE color (
    id SERIAL PRIMARY KEY,
    name TEXT UNIQUE
);

INSERT INTO fruit(name)
SELECT DISTINCT fruit_name
FROM original;

INSERT INTO color(name)
SELECT DISTINCT color_name
FROM original;

CREATE TABLE connection(
    id SERIAL PRIMARY KEY,
    fruit_name TEXT,
    fruit_id INTEGER REFERENCES fruit(id) ON DELETE CASCADE,
    color_id INTEGER REFERENCES color(id) ON DELETE CASCADE,
    color_name TEXT,
    UNIQUE (fruit_id, color_id)
);

SELECT * FROM connection;

INSERT INTO connection (fruit_name, color_name)
SELECT fruit_name, color_name
FROM original;

UPDATE connection
SET fruit_id = (
    SELECT id
    FROM fruit
    WHERE connection.fruit_name = fruit.name
);

UPDATE connection
SET color_id = (
    SELECT id
    FROM color
    WHERE connection.color_name = color.name
);

ALTER TABLE connection
DROP COLUMN fruit_name;

ALTER TABLE connection
DROP COLUMN color_name;

ALTER TABLE connection
ADD UNIQUE(fruit_id, color_id);

-- Display tables
SELECT * FROM original;
SELECT * FROM fruit;
SELECT * FROM color;
SELECT * FROM connection;

-- Join tables for display
SELECT fruit.name, color.name
FROM fruit
INNER JOIN connection ON connection.fruit_id = fruit.id
INNER JOIN color ON connection.color_id =color.id
ORDER BY fruit.name ASC;
```

- *Note that the primary and foreign keys are different than the example keys when the script is run.  Postgres does not insert the rows values into the connection table in the same order we did.  The script does still run correctly and we sill join fruits and colors back in the end.*

---

## More to Explore

- There of course is always more to explore:
    - The PostgreSQL dialect of SQL is extensive and is even more so if a procedural dialect of SQL is used
    - PostgreSQL is a fully featured RDBMS.  The official documentation is around 3,000 pages long!
- Some of the notable topics left to explore include:
    1. Working with specify data types:
        1. Dates/times
        1. Numeric/money
        1. XML
        1. Geometric
        1. Range
        1. etc.
    1. Mathematical functions
    1. String functions
    1. Trigger functions
    1. Data control language (permissions, schemas, etc.)
    1. Procedural language (further use in stored procedures)
    1. Server administration (all aspects)
    1. Treating PostgreSQL like a BASE DBMS using UUIDs and JSON documents

---